README.org
#+TITLE: Building Gerbil Packages

#+begin_quote
Drew Crampsie @drewc 14:28

Ok, dammit, I have so been trying to avoid becoming a major gerbil contributor
but I think that was self-deprecation mixed with lazy stoner who is overworked
somewhat already lol ... not understanding that it saves time and effort to save
time and effort ... silly man.
#+end_quote


How things are built matters. In order to save time and effort we do not want to
rebuild everything each character change. At the same time, we want to be
liberal and not enforce a style or layout upon developers.


* ~make.ss~: the maker of makefiles

It seems that there is one [[https://github.com/vyzo/gerbil/blob/master/src/std/make.ss][middleman]] that acts as a go between. There is a
[[https://github.com/vyzo/gerbil/blob/master/doc/reference/make.md][reference]] on it, and a [[https://github.com/vyzo/gerbil/blob/master/doc/guide/build.md][guide]] on building as well. I suppose these things are
important to developers!


Using the reference we'll literately re-create the middleman and document/test
in the guide?

#+begin_src shell
cd ~/src/gerbil-build/doc/
cp ~/src/gerbil/doc/reference/make.md .
pandoc -o make.org make.md
#+end_src

Perhaps. For now we'll simple inline things as the thoughts spring up.


* ~/make/gxc~ Compile to a made library

** Step 1: Compile a file to a library

Let us create a file, compile to the right spot, and run it.

#+begin_src scheme :tangle "./test/hello.ss" :mkdir yes
package: drewc
(export hello)

(def (hello) "Hello World")
#+end_src

#+begin_src scheme :tangle test/make1.ss
  (import :gerbil/compiler :std/srfi/13)
  ;; (export #t)

  (def gerbil-path (getenv "GERBIL_PATH" "~/.gerbil"))
  (def libdir (string-append gerbil-path "/lib"))
  (def (module-package ctx)
    (let (id (symbol->string (gx#expander-context-id ctx)))
      (cond ((string-rindex id #\/)
             => (lambda (x) (substring id 0 x)))
            (#t ""))))
  (def (ss-file-libdir file)
    (string-append libdir "/" (module-package (gx#import-module file))))

  (def (make-ss file)
      (compile-file file
                    [output-dir:
                     libdir
                     invoke-gsc: #t
                  ;   keep-scm: #f
                   ;  generate-ssxi: #t
                     verbose: #t
                     ]))

#+end_src

Test it out.

#+begin_src scheme :tangle test/test-hello.ss
  (import :drewc/hello :std/test)
  (check (hello) => "Hello World")

#+end_src

#+begin_src shell :results output code
  rm ~/.gerbil/lib/drewc/hello*
  gxi -e '(load "~/src/gerbil-build/test/make1.ss")' \
      -e '(make-ss "~/src/gerbil-build/test/hello.ss")' \
      -e '(load "~/src/gerbil-build/test/test-hello.ss")'
#+end_src

#+begin_src shell
compile ~/src/gerbil-build/test/hello.ss
compile drewc/hello
compile ~/.gerbil/lib/drewc/hello__0.scm
invoke gsc (gsc -:i8,f8,-8,t8 ~/.gerbil/lib/drewc/hello__0.scm)
compile ~/.gerbil/lib/drewc/hello__rt.scm
invoke gsc (gsc -:i8,f8,-8,t8 ~/.gerbil/lib/drewc/hello__rt.scm)
compile ~/.gerbil/lib/drewc/hello.ssi
... check (hello) is equal? to "Hello World"
#+end_src



*** No package?

What happens if it has no package?
#+begin_src scheme :tangle "./test/hello-no-package.ss" :mkdir yes
(export hello)

(def (hello) "Hello World... NOT!")
#+end_src

#+begin_src scheme :tangle test/test-hello-no-package.ss
  (import :hello-no-package :std/test)
  (check (hello) => "Hello World... NOT!")
#+end_src

#+begin_src shell :results output code
  rm ~/.gerbil/lib/hello-no-package*
  gxi -e '(load "~/src/gerbil-build/test/make1.ss")' \
      -e '(make-ss "~/src/gerbil-build/test/hello-no-package.ss")'\
      -e '(load "~/src/gerbil-build/test/test-hello-no-package.ss")'
#+end_src

#+begin_src shell
compile ~/src/gerbil-build/test/hello-no-package.ss
compile hello-no-package
compile ~/.gerbil/lib/hello-no-package__0.scm
invoke gsc (gsc -:i8,f8,-8,t8 ~/.gerbil/lib/hello-no-package__0.scm)
compile ~/.gerbil/lib/hello-no-package__rt.scm
invoke gsc (gsc -:i8,f8,-8,t8 ~/.gerbil/lib/hello-no-package__rt.scm)
compile ~/.gerbil/lib/hello-no-package.ssi
... check (hello) is equal? to "Hello World... NOT!"
#+end_src

** Step 2: Crib ~gxc-compile~ from Fare

#+begin_src scheme :noweb-ref make-gxc-imports
  (import :gerbil/compiler :std/misc/path :std/misc/list
        :std/misc/concurrent-plan)
#+end_src

