doc/html/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-28 Tue 19:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building Gerbil Packages</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Building Gerbil Packages</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb3d369c"><code>make.ss</code>: the maker of makefiles</a></li>
<li><a href="#orge7bea10"><code>/make/gxc</code> Compile to a made library</a>
<ul>
<li><a href="#orgebe0a36">Step 1: Compile a file to a library</a>
<ul>
<li><a href="#org8ea47cd">No package?</a></li>
</ul>
</li>
<li><a href="#org771b13b">Step 2: Crib <code>gxc-compile</code> from Fare</a>
<ul>
<li><a href="#org95b4601">The Struct</a></li>
<li><a href="#gxc_outputs_begin"><code>gxc-outputs</code>: the end of the beginning</a></li>
<li><a href="#org703bf43">Break into modules</a></li>
<li><a href="#org669cb50"><code>mod</code>'s: Talking 'bout this generation</a></li>
<li><a href="#org11f5adf"><code>gxc-compile-file</code>: `make;make install`</a></li>
<li><a href="#orgaaf1637">bootstrap</a></li>
</ul>
</li>
<li><a href="#org75674b0">Step 3: Release pre-0.1 build</a></li>
<li><a href="#org72d8d62">Step 4: Test the new <code>make/script</code></a></li>
<li><a href="#orga1e2be7">Step 5: Publish Documentation</a></li>
</ul>
</li>
<li><a href="#orged8d92a">Appendicitis</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
Drew Crampsie @drewc 14:28
</p>

<p>
Ok, dammit, I have so been trying to avoid becoming a major gerbil contributor
but I think that was self-deprecation mixed with lazy stoner who is overworked
somewhat already lol &#x2026; not understanding that it saves time and effort to save
time and effort &#x2026; silly man.
</p>
</blockquote>


<p>
How things are built matters. In order to save time and effort we do not want to
rebuild everything each character change. At the same time, we want to be
liberal and not enforce a style or layout upon developers.
</p>


<div id="outline-container-orgb3d369c" class="outline-2">
<h2 id="orgb3d369c"><code>make.ss</code>: the maker of makefiles</h2>
<div class="outline-text-2" id="text-orgb3d369c">
<p>
It seems that there is one <a href="https://github.com/vyzo/gerbil/blob/master/src/std/make.ss">middleman</a> that acts as a go between. There is a
<a href="https://github.com/vyzo/gerbil/blob/master/doc/reference/make.md">reference</a> on it, and a <a href="https://github.com/vyzo/gerbil/blob/master/doc/guide/build.md">guide</a> on building as well. I suppose these things are
important to developers!
</p>


<p>
Using the reference we'll literately re-create the middleman and document/test
in the guide?
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> ~/src/gerbil-build/doc/
cp ~/src/gerbil/doc/reference/make.md .
pandoc -o make.org make.md
</pre>
</div>

<p>
Perhaps. For now we'll simple inline things as the thoughts spring up.
</p>
</div>
</div>


<div id="outline-container-orge7bea10" class="outline-2">
<h2 id="orge7bea10"><code>/make/gxc</code> Compile to a made library</h2>
<div class="outline-text-2" id="text-orge7bea10">
</div>
<div id="outline-container-orgebe0a36" class="outline-3">
<h3 id="orgebe0a36">Step 1: Compile a file to a library</h3>
<div class="outline-text-3" id="text-orgebe0a36">
<p>
Let us create a file, compile to the right spot, and run it.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">package:</span> drewc
(<span style="color: #4f97d7; font-weight: bold;">export</span> hello)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">hello</span>) <span style="color: #2d9574;">"Hello World"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:gerbil/compiler</span> <span style="color: #4f97d7;">:std/srfi/13</span>)
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">(export #t)</span>

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">gerbil-path</span> (getenv <span style="color: #2d9574;">"GERBIL_PATH"</span> <span style="color: #2d9574;">"~/.gerbil"</span>))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">libdir</span> (string-append gerbil-path <span style="color: #2d9574;">"/lib"</span>))
(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">module-package</span> ctx)
  (<span style="color: #4f97d7; font-weight: bold;">let</span> (id (symbol-&gt;string (gx<span style="color: #4f97d7;">#</span>expander-context-id ctx)))
    (<span style="color: #4f97d7; font-weight: bold;">cond</span> ((string-rindex id <span style="color: #4f97d7;">#</span>\/)
           <span style="color: #4f97d7;">=&gt;</span> (<span style="color: #4f97d7; font-weight: bold;">lambda</span> (x) (substring id 0 x)))
          (<span style="color: #4f97d7;">#t</span> <span style="color: #2d9574;">""</span>))))
(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">ss-file-libdir</span> file)
  (string-append libdir <span style="color: #2d9574;">"/"</span> (module-package (gx<span style="color: #4f97d7;">#</span>import-module file))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">make-ss</span> file)
    (compile-file file
                  <span style="color: #7590db;">[</span><span style="color: #4f97d7;">output-dir:</span>
                   libdir
                   <span style="color: #4f97d7;">invoke-gsc:</span> <span style="color: #4f97d7;">#t</span>
                <span style="color: #2aa1ae; background-color: #292e34;">;   </span><span style="color: #2aa1ae; background-color: #292e34;">keep-scm: #f</span>
                 <span style="color: #2aa1ae; background-color: #292e34;">;  </span><span style="color: #2aa1ae; background-color: #292e34;">generate-ssxi: #t</span>
                   <span style="color: #4f97d7;">verbose:</span> <span style="color: #4f97d7;">#t</span>
                   <span style="color: #7590db;">]</span>))

</pre>
</div>

<p>
Test it out.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:drewc/hello</span> <span style="color: #4f97d7;">:std/test</span>)
(check (hello) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #2d9574;">"Hello World"</span>)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">rm ~/.gerbil/lib/drewc/hello*
gxi -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/make1.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(make-ss "~/src/gerbil-build/test/hello.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-hello.ss")'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">compile ~/src/gerbil-build/test/hello.ss
compile drewc/hello
compile ~/.gerbil/lib/drewc/hello__0.scm
invoke gsc <span style="color: #4f97d7;">(</span>gsc -:i8,f8,-8,t8 ~/.gerbil/lib/drewc/hello__0.scm<span style="color: #4f97d7;">)</span>
compile ~/.gerbil/lib/drewc/hello__rt.scm
invoke gsc <span style="color: #4f97d7;">(</span>gsc -:i8,f8,-8,t8 ~/.gerbil/lib/drewc/hello__rt.scm<span style="color: #4f97d7;">)</span>
compile ~/.gerbil/lib/drewc/hello.ssi
... check <span style="color: #4f97d7;">(</span>hello<span style="color: #4f97d7;">)</span> is equal? to <span style="color: #2d9574;">"Hello World"</span>
</pre>
</div>
</div>



<div id="outline-container-org8ea47cd" class="outline-4">
<h4 id="org8ea47cd">No package?</h4>
<div class="outline-text-4" id="text-org8ea47cd">
<p>
What happens if it has no package?
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">export</span> hello)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">hello</span>) <span style="color: #2d9574;">"Hello World... NOT!"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:hello-no-package</span> <span style="color: #4f97d7;">:std/test</span>)
(check (hello) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #2d9574;">"Hello World... NOT!"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">rm ~/.gerbil/lib/hello-no-package*
gxi -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/make1.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(make-ss "~/src/gerbil-build/test/hello-no-package.ss")'</span><span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-hello-no-package.ss")'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">compile ~/src/gerbil-build/test/hello-no-package.ss
compile hello-no-package
compile ~/.gerbil/lib/hello-no-package__0.scm
invoke gsc <span style="color: #4f97d7;">(</span>gsc -:i8,f8,-8,t8 ~/.gerbil/lib/hello-no-package__0.scm<span style="color: #4f97d7;">)</span>
compile ~/.gerbil/lib/hello-no-package__rt.scm
invoke gsc <span style="color: #4f97d7;">(</span>gsc -:i8,f8,-8,t8 ~/.gerbil/lib/hello-no-package__rt.scm<span style="color: #4f97d7;">)</span>
compile ~/.gerbil/lib/hello-no-package.ssi
... check <span style="color: #4f97d7;">(</span>hello<span style="color: #4f97d7;">)</span> is equal? to <span style="color: #2d9574;">"Hello World... NOT!"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org771b13b" class="outline-3">
<h3 id="org771b13b">Step 2: Crib <code>gxc-compile</code> from Fare</h3>
<div class="outline-text-3" id="text-org771b13b">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:gerbil/compiler</span> <span style="color: #4f97d7;">:std/misc/path</span> <span style="color: #4f97d7;">:std/misc/list</span>
      <span style="color: #4f97d7;">:std/misc/concurrent-plan</span>)
</pre>
</div>
</div>
