README.org
*** The Struct 
 We need a ~settings~ struct to start off with. We'll make it almost identical
 save for renaming ~prefix~ to ~package~.

 #+begin_src scheme :noweb-ref settings-struct
    ;;; Settings: see details in doc/reference/make.md
    (defstruct settings
      (srcdir libdir bindir package force optimize debug static static-debug verbose build-deps
       libdir-prefix parallelize)
      transparent: #t constructor: :init!)

   (def current-make-settings (make-parameter #f))
 #+end_src

 One of the reasons behind this is to use many cores while compiling.

 #+begin_src scheme :noweb-ref gerbil-build-cores
   (def (gerbil-build-cores)
     (with-catch (lambda (_) (##cpu-count)) (lambda () (string->number (getenv "GERBIL_BUILD_CORES")))))
 #+end_src

 In the init things need to change as well.


 #+begin_src scheme :noweb-ref settings-init
   (defmethod {:init! settings}
    (lambda (self
        srcdir: (srcdir_ #f) libdir: (libdir_ #f) bindir: (bindir_ #f)
        package: (package_ #f) force: (force? #f)
        optimize: (optimize #t) debug: (debug 'env)
        static: (static #t) static-debug: (static-debug #f)
        verbose: (verbose #f) build-deps: (build-deps_ #f)
        parallelize: (parallelize_ #t))
      (def gerbil-path (getenv "GERBIL_PATH" "~/.gerbil"))
      (def srcdir (or srcdir_ (error "srcdir must be specified")))
      (def libdir (or libdir_ (path-expand "lib" gerbil-path)))
      (def bindir (or bindir_ (path-expand "bin" gerbil-path)))
      (def package (and package_ (if (symbol? package_) (symbol->string package_) package_)))
      (def libdir-prefix (if package (path-expand package libdir) libdir))
      (def build-deps (path-expand (or build-deps_ "build-deps") srcdir))
      (def parallelize (if (eq? parallelize_ #t) (gerbil-build-cores) (or parallelize_ 0)))
      (struct-instance-init!
        self
        srcdir libdir bindir package force? optimize debug static static-debug verbose build-deps
        libdir-prefix parallelize))
    rebind: #t)
 #+end_src

 Now for the compilations. Rather than have it all chunked together I'll break it
 into parts I can grasp a wee bit more.

*** ~gxc-outputs~: the end of the beginning
    :PROPERTIES:
    :CUSTOM_ID: gxc_outputs_begin
    :END:

 Strangely enough, it seems that the entire reason I started this was an error
 that may get taken care of by redefining ~gxc-outputs~.

 Essentially, I want to return a list of the files ~gxc~ transpiles to, and any
 static files that are output.

 I need to know a few paths
  1) The source code path
  2) The library path
  3) The static path

**** Source path
  The first is easy.

 #+begin_src scheme :noweb-ref source-path
   (def (source-path mod ext settings)
     (path-expand (path-default-extension mod ext) (settings-srcdir settings)))
 #+end_src

**** Library Path and Packages: The end all be all

 The compiler can put the compiled files in different locations that all depend
 on the package of that source file.

 We call a source file a ~mod~. This is a string like "test/hello".

 Every source file compiled by ~gxc~ is also a [[https://github.com/vyzo/gerbil/blob/master/src/gerbil/expander/module.ss][module]]. It may have a different
 super-package based on the ~package:~ keyword in the file or in a local or
 parent ~gerbil.pkg~.
 
 The packages postfix to the library path then together they prefix the result
 location. It also may not exist.

 These are how they are discovered, in order.

 1) The ~module-id~ of the module, or..
 2) The ~gerbil.pkg~ in the directory containing the source file itself OR any
    parent directories up to ~srcdir:~. If not...
 3) The ~package:~ option to the make ~settings~.


 Let's add a few test files

   A toplevel ~test/gerbil.pkg~
   #+begin_src scheme :tangle test/gerbil.pkg
   (package: drewc/build-test)
   #+end_src

   Another one in ~test/sub/gerbil.pkg~.
   #+begin_src scheme :tangle test/sub/gerbil.pkg
   (package: drewc/take-on-me)
   #+end_src

  A source file ~test/sub/goodbye.ss~
 
   #+begin_src scheme :tangle "./test/sub/goodbye.ss"
   (export gbye)

   (def (gbye) "Goodbye World")
   #+end_src

