doc/html/README.html

<div id="outline-container-org95b4601" class="outline-4">
<h4 id="org95b4601">The Struct</h4>
<div class="outline-text-4" id="text-org95b4601">
<p>
We need a <code>settings</code> struct to start off with. We'll make it almost identical
save for renaming <code>prefix</code> to <code>package</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme"> <span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">Settings: see details in doc/reference/make.md</span>
 (<span style="color: #4f97d7; font-weight: bold;">defstruct</span> <span style="color: #ce537a; font-weight: bold;">settings</span>
   (srcdir libdir bindir package force optimize debug static static-debug verbose build-deps
    libdir-prefix parallelize)
   <span style="color: #4f97d7;">transparent:</span> <span style="color: #4f97d7;">#t</span> <span style="color: #4f97d7;">constructor:</span> <span style="color: #4f97d7;">:init!</span>)

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">current-make-settings</span> (make-parameter <span style="color: #4f97d7;">#f</span>))
</pre>
</div>

<p>
One of the reasons behind this is to use many cores while compiling.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">gerbil-build-cores</span>)
  (with-catch (<span style="color: #4f97d7; font-weight: bold;">lambda</span> (<span style="color: #4f97d7;">_</span>) (<span style="color: #4f97d7;">##</span>cpu-count)) (<span style="color: #4f97d7; font-weight: bold;">lambda</span> () (string-&gt;number (getenv <span style="color: #2d9574;">"GERBIL_BUILD_CORES"</span>)))))
</pre>
</div>

<p>
In the init things need to change as well.
</p>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">defmethod</span> <span style="color: #7590db;">{</span><span style="color: #4f97d7;">:init!</span> settings<span style="color: #7590db;">}</span>
 (<span style="color: #4f97d7; font-weight: bold;">lambda</span> (self
     <span style="color: #4f97d7;">srcdir:</span> (srcdir<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>) <span style="color: #4f97d7;">libdir:</span> (libdir<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>) <span style="color: #4f97d7;">bindir:</span> (bindir<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>)
     <span style="color: #4f97d7;">package:</span> (package<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>) <span style="color: #4f97d7;">force:</span> (force? <span style="color: #4f97d7;">#f</span>)
     <span style="color: #4f97d7;">optimize:</span> (optimize <span style="color: #4f97d7;">#t</span>) <span style="color: #4f97d7;">debug:</span> (debug <span style="color: #4f97d7; font-weight: bold;">'</span>env)
     <span style="color: #4f97d7;">static:</span> (static <span style="color: #4f97d7;">#t</span>) <span style="color: #4f97d7;">static-debug:</span> (static-debug <span style="color: #4f97d7;">#f</span>)
     <span style="color: #4f97d7;">verbose:</span> (verbose <span style="color: #4f97d7;">#f</span>) <span style="color: #4f97d7;">build-deps:</span> (build-deps<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>)
     <span style="color: #4f97d7;">parallelize:</span> (parallelize<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#t</span>))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">gerbil-path</span> (getenv <span style="color: #2d9574;">"GERBIL_PATH"</span> <span style="color: #2d9574;">"~/.gerbil"</span>))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">srcdir</span> (<span style="color: #4f97d7; font-weight: bold;">or</span> srcdir<span style="color: #4f97d7;">_</span> (<span style="color: #4f97d7; font-weight: bold;">error</span> <span style="color: #2d9574;">"srcdir must be specified"</span>)))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">libdir</span> (<span style="color: #4f97d7; font-weight: bold;">or</span> libdir<span style="color: #4f97d7;">_</span> (path-expand <span style="color: #2d9574;">"lib"</span> gerbil-path)))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bindir</span> (<span style="color: #4f97d7; font-weight: bold;">or</span> bindir<span style="color: #4f97d7;">_</span> (path-expand <span style="color: #2d9574;">"bin"</span> gerbil-path)))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">package</span> (<span style="color: #4f97d7; font-weight: bold;">and</span> package<span style="color: #4f97d7;">_</span> (<span style="color: #4f97d7; font-weight: bold;">if</span> (symbol? package<span style="color: #4f97d7;">_</span>) (symbol-&gt;string package<span style="color: #4f97d7;">_</span>) package<span style="color: #4f97d7;">_</span>)))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">libdir-prefix</span> (<span style="color: #4f97d7; font-weight: bold;">if</span> package (path-expand package libdir) libdir))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">build-deps</span> (path-expand (<span style="color: #4f97d7; font-weight: bold;">or</span> build-deps<span style="color: #4f97d7;">_</span> <span style="color: #2d9574;">"build-deps"</span>) srcdir))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">parallelize</span> (<span style="color: #4f97d7; font-weight: bold;">if</span> (eq? parallelize<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#t</span>) (gerbil-build-cores) (<span style="color: #4f97d7; font-weight: bold;">or</span> parallelize<span style="color: #4f97d7;">_</span> 0)))
   (struct-instance-init!
     self
     srcdir libdir bindir package force? optimize debug static static-debug verbose build-deps
     libdir-prefix parallelize))
 <span style="color: #4f97d7;">rebind:</span> <span style="color: #4f97d7;">#t</span>)
</pre>
</div>

<p>
Now for the compilations. Rather than have it all chunked together I'll break it
into parts I can grasp a wee bit more.
</p>
</div>
</div>

<div id="outline-container-orgd03bc43" class="outline-4">
<h4 id="gxc_outputs_begin"><code>gxc-outputs</code>: the end of the beginning</h4>
<div class="outline-text-4" id="text-gxc_outputs_begin">
<p>
Strangely enough, it seems that the entire reason I started this was an error
that may get taken care of by redefining <code>gxc-outputs</code>.
</p>

<p>
Essentially, I want to return a list of the files <code>gxc</code> transpiles to, and any
static files that are output.
</p>

<p>
I need to know a few paths
</p>
<ol class="org-ol">
<li>The source code path</li>
<li>The library path</li>
<li>The static path</li>
</ol>
</div>

<ul class="org-ul">
<li><a id="org79247a5"></a>Source path<br />
<div class="outline-text-5" id="text-org79247a5">
<p>
The first is easy.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">source-path</span> mod ext settings)
  (path-expand (path-default-extension mod ext) (settings-srcdir settings)))
</pre>
</div>
</div>
</li>

<li><a id="org54d56b3"></a>Library Path and Packages: The end all be all<br />
<div class="outline-text-5" id="text-org54d56b3">
<p>
The compiler can put the compiled files in different locations that all depend
on the package of that source file.
</p>

<p>
We call a source file a <code>mod</code>. This is a string like "test/hello".
</p>

<p>
Every source file compiled by <code>gxc</code> is also a <a href="https://github.com/vyzo/gerbil/blob/master/src/gerbil/expander/module.ss">module</a>. It may have a different
super-package based on the <code>package:</code> keyword in the file or in a local or
parent <code>gerbil.pkg</code>.
</p>

<p>
The packages postfix to the library path then together they prefix the result
location. It also may not exist.
</p>

<p>
These are how they are discovered, in order.
</p>

<ol class="org-ol">
<li>The <code>module-id</code> of the module, or..</li>
<li>The <code>gerbil.pkg</code> in the directory containing the source file itself OR any
parent directories up to <code>srcdir:</code>. If not&#x2026;</li>
<li>The <code>package:</code> option to the make <code>settings</code>.</li>
</ol>


<p>
Let's add a few test files
</p>

<p>
A toplevel <code>test/gerbil.pkg</code>
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7;">package:</span> drewc/build-test)
</pre>
</div>

<p>
Another one in <code>test/sub/gerbil.pkg</code>.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7;">package:</span> drewc/take-on-me)
</pre>
</div>

<p>
A source file <code>test/sub/goodbye.ss</code>
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">export</span> gbye)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">gbye</span>) <span style="color: #2d9574;">"Goodbye World"</span>)
</pre>
</div>
</div>

<ul class="org-ul">
