README.org
***** ~mod-module~: Every ~.ss~ is a module

      An ~-id~ is a symbol, a ~-package~ a string.

#+begin_src scheme :noweb-ref mod-modules
  (def mod-modules (make-hash-table)) ;;; cache
  (def (mod-module mod (settings (current-make-settings)) (reload? #f))
    (let (v (hash-ref mod-modules mod (void)))
      (if (and (not (void? v)) (not reload?)) v
          (let* ((src (source-path mod ".ss" settings))
                 (m (and (file-exists? src) (gx#import-module src reload?))))
            (begin0 m (hash-put! mod-modules mod m))))))

  (def module-id gx#expander-context-id)
  (def module-id-set! gx#expander-context-id-set!)
 #+end_src

(For our ~"test/hello"~ mod, ~test/sub/gbye~ and ~"test/hello-no-package"~, it is
correct.

  - ~"test/hello"~ :: has ~package: drewc~ at the top. That defines the
                      containing package as ~drewc~, and since this file is
                      called ~hello~, the id is ~drewc/hello~.
  - ~"test/hello-no-package"~ :: It is ~drewc/build-test/hello-no-package~ with the
       prefix coming from the ~test/gerbil.pkg~
  -  ~"test/sub/goodbyebye:~  :: ~drewc/take-on-me~ is the container from
       ~test/sub/gerbil.pkg~

#+begin_src scheme :tangle test/test-hello-goodbye.ss
  (import :std/test)
  (def test-settings (settings srcdir: "~/src/gerbil-build"))

  (def test/hello-module (mod-module "test/hello" test-settings))
  (def test/sub/goodbye-module (mod-module "test/sub/goodbye" test-settings #t))
  (def test/hello-no-package-module (mod-module "test/hello-no-package" test-settings))

  (check (module-id test/hello-module) => 'drewc/hello)
  (check (module-id test/sub/goodbye-module) => 'drewc/take-on-me/goodbye)
  (check (module-id test/hello-no-package-module)
         => 'drewc/build-test/hello-no-package)
#+end_src

***** ~mod-core-module~: The module has no root

 Finding the actual package can be a problem if we have it laid out on the
 filesystem where any of the parents have a ~gerbil.pkg~.

 For example, a git subtree that you want to build should not change based on
 the fact that you store it in another directory.

  We'll lay out a new project and a file like this:

    *./test/new-project/hello-no-package.ss*

  Now, without any package and without a ~gerbil.pkg~, when we try to make that
  project, what comes up?


#+begin_src scheme :tangle "./test/new-project/new-hello-no-package.ss" :mkdirp yes
(export hello)
(def (hello) "Hello World... New Project!")
#+end_src


#+begin_src scheme
   (import :std/test)
  (def test-new-project-settings (settings srcdir: "~/src/gerbil-build/test/new-project")) 

   (def test/new-project-hello-no-package-module
     (mod-module "new-hello-no-package" test-new-project-settings))

   ;;; This passes the test, but fails at what we want
   (check (module-id test/new-project-hello-no-package-module)
          => 'drewc/build-test/new-project/new-hello-no-package)
#+end_src

The importer always looks towards parent directories for a package. That makes
sense as it cannot know where to stop and always tried to succeed. That is a
wonderful thing that makes life so much easier, but does result in some antics.

As luck would have it, *vyzo* has taken care of the details in
~gx#core-read-module~.

#+begin_src scheme :noweb-ref mod-core-modules
  (def mod-core-modules (make-hash-table))
  (def (mod-core-module mod (settings (current-make-settings)) (reload? #f))
    ;; => (values prelude module-id module-ns body)
    (def (mrm)
      (let (v (if reload? (void) (hash-ref mod-core-modules mod (void))))
        (if (not (void? v)) v
            (let* ((src (path-force-extension mod ".ss"))
                   (rm (and (file-exists? src) (gx#core-read-module src))))
              (begin0 rm (hash-put! mod-core-modules mod rm))))))
    (let ((srcdir (path-normalize (settings-srcdir settings)))
          (cd (path-normalize (current-directory))))
      (if (equal? srcdir cd) (mrm)
          (parameterize ((current-directory srcdir))
            (mrm)))))

  (def core-module-prelude (cut values-ref <> 0))
  (def core-module-id (cut values-ref <> 1))
  (def core-module-ns (cut values-ref <> 2))
  (def core-module-code (cut values-ref <> 3))
 #+end_src

With that we can now see that this has no package.

#+begin_src scheme
  (import :std/test)

  (def test/new-project-hello-no-package-core-module
    (mod-core-module "new-hello-no-package" test-new-project-settings))

  (check (core-module-id test/new-project-hello-no-package-core-module)
         => 'new-hello-no-package)
#+end_src

