doc/html/README.html
<li><a id="orgd46d6a8"></a><code>mod-module</code>: Every <code>.ss</code> is a module<br />
<div class="outline-text-6" id="text-orgd46d6a8">
<p>
An <code>-id</code> is a symbol, a <code>-package</code> a string.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">mod-modules</span> (make-hash-table)) <span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">cache</span>
(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">mod-module</span> mod (settings (current-make-settings)) (reload? <span style="color: #4f97d7;">#f</span>))
  (<span style="color: #4f97d7; font-weight: bold;">let</span> (v (hash-ref mod-modules mod (void)))
    (<span style="color: #4f97d7; font-weight: bold;">if</span> (<span style="color: #4f97d7; font-weight: bold;">and</span> (<span style="color: #4f97d7; font-weight: bold;">not</span> (void? v)) (<span style="color: #4f97d7; font-weight: bold;">not</span> reload?)) v
        (<span style="color: #4f97d7; font-weight: bold;">let*</span> ((src (source-path mod <span style="color: #2d9574;">".ss"</span> settings))
               (m (<span style="color: #4f97d7; font-weight: bold;">and</span> (file-exists? src) (gx<span style="color: #4f97d7;">#</span>import-module src reload?))))
          (<span style="color: #4f97d7; font-weight: bold;">begin0</span> m (hash-put! mod-modules mod m))))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">module-id</span> gx<span style="color: #4f97d7;">#</span>expander-context-id)
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">module-id-set!</span> gx<span style="color: #4f97d7;">#</span>expander-context-id-set!)
</pre>
</div>

<p>
(For our <code>"test/hello"</code> mod, <code>test/sub/gbye</code> and <code>"test/hello-no-package"</code>, it is
correct.
</p>

<dl class="org-dl">
<dt><code>"test/hello"</code></dt><dd>has <code>package: drewc</code> at the top. That defines the
containing package as <code>drewc</code>, and since this file is
called <code>hello</code>, the id is <code>drewc/hello</code>.</dd>
<dt><code>"test/hello-no-package"</code></dt><dd>It is <code>drewc/build-test/hello-no-package</code> with the
prefix coming from the <code>test/gerbil.pkg</code></dd>
<dt><code>"test/sub/goodbyebye:</code> </dt><dd><code>drewc/take-on-me</code> is the container from
<code>test/sub/gerbil.pkg</code></dd>
</dl>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/test</span>)
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test-settings</span> (settings <span style="color: #4f97d7;">srcdir:</span> <span style="color: #2d9574;">"~/src/gerbil-build"</span>))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/hello-module</span> (mod-module <span style="color: #2d9574;">"test/hello"</span> test-settings))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/sub/goodbye-module</span> (mod-module <span style="color: #2d9574;">"test/sub/goodbye"</span> test-settings <span style="color: #4f97d7;">#t</span>))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/hello-no-package-module</span> (mod-module <span style="color: #2d9574;">"test/hello-no-package"</span> test-settings))

(check (module-id test/hello-module) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>drewc/hello)
(check (module-id test/sub/goodbye-module) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>drewc/take-on-me/goodbye)
(check (module-id test/hello-no-package-module)
       <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>drewc/build-test/hello-no-package)
</pre>
</div>
</div>
</li>

<li><a id="orgb5a3792"></a><code>mod-core-module</code>: The module has no root<br />
<div class="outline-text-6" id="text-orgb5a3792">
<p>
Finding the actual package can be a problem if we have it laid out on the
filesystem where any of the parents have a <code>gerbil.pkg</code>.
</p>

<p>
For example, a git subtree that you want to build should not change based on
the fact that you store it in another directory.
</p>

<p>
We'll lay out a new project and a file like this:
</p>

<p>
<b>./test/new-project/hello-no-package.ss</b>
</p>

<p>
Now, without any package and without a <code>gerbil.pkg</code>, when we try to make that
project, what comes up?
</p>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">export</span> hello)
(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">hello</span>) <span style="color: #2d9574;">"Hello World... New Project!"</span>)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-scheme"> (<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/test</span>)
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test-new-project-settings</span> (settings <span style="color: #4f97d7;">srcdir:</span> <span style="color: #2d9574;">"~/src/gerbil-build/test/new-project"</span>)) 

 (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/new-project-hello-no-package-module</span>
   (mod-module <span style="color: #2d9574;">"new-hello-no-package"</span> test-new-project-settings))

 <span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">This passes the test, but fails at what we want</span>
 (check (module-id test/new-project-hello-no-package-module)
        <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>drewc/build-test/new-project/new-hello-no-package)
</pre>
</div>

<p>
The importer always looks towards parent directories for a package. That makes
sense as it cannot know where to stop and always tried to succeed. That is a
wonderful thing that makes life so much easier, but does result in some antics.
</p>

<p>
As luck would have it, <b>vyzo</b> has taken care of the details in
<code>gx#core-read-module</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">mod-core-modules</span> (make-hash-table))
(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">mod-core-module</span> mod (settings (current-make-settings)) (reload? <span style="color: #4f97d7;">#f</span>))
  <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; (values prelude module-id module-ns body)</span>
  (<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">mrm</span>)
    (<span style="color: #4f97d7; font-weight: bold;">let</span> (v (<span style="color: #4f97d7; font-weight: bold;">if</span> reload? (void) (hash-ref mod-core-modules mod (void))))
      (<span style="color: #4f97d7; font-weight: bold;">if</span> (<span style="color: #4f97d7; font-weight: bold;">not</span> (void? v)) v
          (<span style="color: #4f97d7; font-weight: bold;">let*</span> ((src (path-force-extension mod <span style="color: #2d9574;">".ss"</span>))
                 (rm (<span style="color: #4f97d7; font-weight: bold;">and</span> (file-exists? src) (gx<span style="color: #4f97d7;">#</span>core-read-module src))))
            (<span style="color: #4f97d7; font-weight: bold;">begin0</span> rm (hash-put! mod-core-modules mod rm))))))
  (<span style="color: #4f97d7; font-weight: bold;">let</span> ((srcdir (path-normalize (settings-srcdir settings)))
        (cd (path-normalize (current-directory))))
    (<span style="color: #4f97d7; font-weight: bold;">if</span> (equal? srcdir cd) (mrm)
        (<span style="color: #4f97d7; font-weight: bold;">parameterize</span> ((current-directory srcdir))
          (mrm)))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">core-module-prelude</span> (<span style="color: #4f97d7; font-weight: bold;">cut</span> values-ref <span style="color: #4f97d7;">&lt;&gt;</span> 0))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">core-module-id</span> (<span style="color: #4f97d7; font-weight: bold;">cut</span> values-ref <span style="color: #4f97d7;">&lt;&gt;</span> 1))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">core-module-ns</span> (<span style="color: #4f97d7; font-weight: bold;">cut</span> values-ref <span style="color: #4f97d7;">&lt;&gt;</span> 2))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">core-module-code</span> (<span style="color: #4f97d7; font-weight: bold;">cut</span> values-ref <span style="color: #4f97d7;">&lt;&gt;</span> 3))
</pre>
</div>

<p>
With that we can now see that this has no package.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/test</span>)

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/new-project-hello-no-package-core-module</span>
  (mod-core-module <span style="color: #2d9574;">"new-hello-no-package"</span> test-new-project-settings))

(check (core-module-id test/new-project-hello-no-package-core-module)
       <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>new-hello-no-package)
</pre>
</div>
</div>
</li>
