README.org
***** Some testing and asking the compiler where it places things

What happens when we compile that module as is?

#+begin_src scheme :tangle test/test-compile-as-is.ss
 (def test-new-project-settings (settings srcdir: "~/src/gerbil-build/test/new-project"))

  (def test/new-project-hello-no-package-module
    (mod-module "new-hello-no-package" test-new-project-settings))
#+end_src

#+begin_src shell :results output code
  rm ~/.gerbil/lib/drewc/build-test/new-project/new-hello-no-package*
  gxi -e '(load "~/src/gerbil-build/test/make1.ss")' \
      -e '(load "~/src/gerbil-build/test/test-make-gxc.ss")' \
      -e '(load "~/src/gerbil-build/test/test-compile-as-is.ss")' \
      -e '(make-ss "~/src/gerbil-build/test/new-project/new-hello-no-package.ss")'
#+end_src


It ends up in *~/.gerbil/lib/drewc/build-test/new-project/*. We knew that.

#+begin_src shell
# => [...]
compile drewc/build-test/new-project/new-hello-no-package
#+end_src


If we set the id to ~new-hello-no-package~, say from the ~core-module-id~?

#+begin_src scheme :tangle test/test-compile-set-id.ss
  (def test/new-project-hello-no-package-core-module
      (mod-core-module "new-hello-no-package" test-new-project-settings))

  (set! (module-id test/new-project-hello-no-package-module)
        (core-module-id test/new-project-hello-no-package-core-module))
#+end_src



Awesome! That should now means that it tests out.

#+begin_src scheme :tangle test/test-new-hello-no-package.ss
(import :std/test :new-hello-no-package)
(check (hello) => "Hello World... New Project!")
#+end_src

#+begin_src shell :results output code
    rm ~/.gerbil/lib/drewc/new-hello-no-package*
    gxi -e '(load "~/src/gerbil-build/test/make1.ss")' \
        -e '(load "~/src/gerbil-build/test/test-make-gxc.ss")' \
        -e '(load "~/src/gerbil-build/test/test-compile-as-is.ss")' \
        -e '(load "~/src/gerbil-build/test/test-compile-set-id.ss")' \
        -e '(make-ss "~/src/gerbil-build/test/new-project/new-hello-no-package.ss")' \
        -e '(load "~/src/gerbil-build/test/test-new-hello-no-package.ss")'
#+end_src
#+begin_src shell
# =>
... check (hello) is equal? to "Hello World... New Project!"
#+end_src


***** ~mod-module-id~: Finally, we know where it is and how to set it

#+begin_src scheme :noweb-ref mod-module-id
  (def (mod-module-id mod (settings (current-make-settings)))
    (let ((mcm (mod-core-module mod settings))
          (sp (settings-package settings)))
      ;; If the core module package is the same as the mod that means we could not
      ;; find a package.
      (if (equal? mod (symbol->string (core-module-id mcm)))
        ;; If we do not have a toplevel package we are the package.
        (if (not sp) (string->symbol mod)
            ;; otherwise add it as a super and return
            (string->symbol (path-expand mod sp)))
        ;; Otherwise the mrm has the right id
        (core-module-id mcm))))
 #+end_src

Yes! Now we can specify where things go based on where they are.

#+begin_src scheme
  (import :std/test)
  (let* ((mod "new-hello-no-package")
         (modn (path-expand mod "new-project"))
         (modtn (path-expand modn "test"))
         (newsetdir "~/src/gerbil-build/test/new-project")
         (testsetdir
          (path-directory (path-strip-trailing-directory-separator newsetdir)))
         (srcsetdir
          (path-directory (path-strip-trailing-directory-separator testsetdir))))

    ;;  make'ing it from that directory should have no container

    (check (mod-module-id mod (settings srcdir: newsetdir)) => 'new-hello-no-package)

    ;;  make'ing it from the parent picks up the parents gerbil.pkg

    (check (mod-module-id modn (settings srcdir: srcsetdir))
           => 'drewc/build-test/new-project/new-hello-no-package)

    ;;  make'ing it from the parent parent's parent should also picks up the
    ;;  parents gerbil.pkg

    (check (mod-module-id modtn (settings srcdir: testsetdir))
           => 'drewc/build-test/new-project/new-hello-no-package))
#+end_src

