doc/html/README.html

<li><a id="org143e833"></a>Some testing and asking the compiler where it places things<br />
<div class="outline-text-6" id="text-org143e833">
<p>
What happens when we compile that module as is?
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test-new-project-settings</span> (settings <span style="color: #4f97d7;">srcdir:</span> <span style="color: #2d9574;">"~/src/gerbil-build/test/new-project"</span>))

 (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/new-project-hello-no-package-module</span>
   (mod-module <span style="color: #2d9574;">"new-hello-no-package"</span> test-new-project-settings))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">rm ~/.gerbil/lib/drewc/build-test/new-project/new-hello-no-package*
gxi -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/make1.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-make-gxc.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-compile-as-is.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(make-ss "~/src/gerbil-build/test/new-project/new-hello-no-package.ss")'</span>
</pre>
</div>


<p>
It ends up in <b>~/.gerbil/lib/drewc/build-test/new-project/</b>. We knew that.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [...]</span>
compile drewc/build-test/new-project/new-hello-no-package
</pre>
</div>


<p>
If we set the id to <code>new-hello-no-package</code>, say from the <code>core-module-id</code>?
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/new-project-hello-no-package-core-module</span>
    (mod-core-module <span style="color: #2d9574;">"new-hello-no-package"</span> test-new-project-settings))

(<span style="color: #4f97d7; font-weight: bold;">set!</span> (module-id test/new-project-hello-no-package-module)
      (core-module-id test/new-project-hello-no-package-core-module))
</pre>
</div>



<p>
Awesome! That should now means that it tests out.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/test</span> <span style="color: #4f97d7;">:new-hello-no-package</span>)
(check (hello) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #2d9574;">"Hello World... New Project!"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">rm ~/.gerbil/lib/drewc/new-hello-no-package*
gxi -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/make1.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-make-gxc.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-compile-as-is.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-compile-set-id.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(make-ss "~/src/gerbil-build/test/new-project/new-hello-no-package.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-new-hello-no-package.ss")'</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt;</span>
... check <span style="color: #4f97d7;">(</span>hello<span style="color: #4f97d7;">)</span> is equal? to <span style="color: #2d9574;">"Hello World... New Project!"</span>
</pre>
</div>
</div>
</li>


<li><a id="org7241b95"></a><code>mod-module-id</code>: Finally, we know where it is and how to set it<br />
<div class="outline-text-6" id="text-org7241b95">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">mod-module-id</span> mod (settings (current-make-settings)))
  (<span style="color: #4f97d7; font-weight: bold;">let</span> ((mcm (mod-core-module mod settings))
        (sp (settings-package settings)))
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">If the core module package is the same as the mod that means we could not</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">find a package.</span>
    (<span style="color: #4f97d7; font-weight: bold;">if</span> (equal? mod (symbol-&gt;string (core-module-id mcm)))
      <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">If we do not have a toplevel package we are the package.</span>
      (<span style="color: #4f97d7; font-weight: bold;">if</span> (<span style="color: #4f97d7; font-weight: bold;">not</span> sp) (string-&gt;symbol mod)
          <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">otherwise add it as a super and return</span>
          (string-&gt;symbol (path-expand mod sp)))
      <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Otherwise the mrm has the right id</span>
      (core-module-id mcm))))
</pre>
</div>

<p>
Yes! Now we can specify where things go based on where they are.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/test</span>)
(<span style="color: #4f97d7; font-weight: bold;">let*</span> ((mod <span style="color: #2d9574;">"new-hello-no-package"</span>)
       (modn (path-expand mod <span style="color: #2d9574;">"new-project"</span>))
       (modtn (path-expand modn <span style="color: #2d9574;">"test"</span>))
       (newsetdir <span style="color: #2d9574;">"~/src/gerbil-build/test/new-project"</span>)
       (testsetdir
        (path-directory (path-strip-trailing-directory-separator newsetdir)))
       (srcsetdir
        (path-directory (path-strip-trailing-directory-separator testsetdir))))

  <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">make'ing it from that directory should have no container</span>

  (check (mod-module-id mod (settings <span style="color: #4f97d7;">srcdir:</span> newsetdir)) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>new-hello-no-package)

  <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">make'ing it from the parent picks up the parents gerbil.pkg</span>

  (check (mod-module-id modn (settings <span style="color: #4f97d7;">srcdir:</span> srcsetdir))
         <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>drewc/build-test/new-project/new-hello-no-package)

  <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">make'ing it from the parent parent's parent should also picks up the</span>
  <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">parents gerbil.pkg</span>

  (check (mod-module-id modtn (settings <span style="color: #4f97d7;">srcdir:</span> testsetdir))
         <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>drewc/build-test/new-project/new-hello-no-package))
</pre>
</div>
</div>
</li>
</ul>
</li>
