README.org
**** ~namespace:~ and ~prelude~: Two other things that are set for modules

       The compiler also picks up those keywords from a parent so that even
       setting the ~module-id~ can leave us with some surprises.

       When we name a hello something else, we can import it as such.

 #+begin_src scheme :tangle test/test-compile-set-id-to-foobarbaz.ss
   (def test/new-project-hello-no-package-core-module
       (mod-core-module "new-hello-no-package" test-new-project-settings))

   (set! (module-id test/new-project-hello-no-package-module) 'foobarbaz)
 #+end_src


 The issue is that the namespace is not set correctly. For example, the ~test/hello.ss~ file.


 #+begin_src scheme
   (import :std/test :drewc/hello)
   (check (drewc/hello#hello) => "Hello World")
 #+end_src

 But, for that ~:foobarbaz~ it's quite different.

 #+begin_src scheme :tangle test/test-improper-namespace.ss
   (import :std/sugar :std/test :foobarbaz)
   (check (hello) => "Hello World... New Project!")

   ;;; This test passes but it shoudn't
   (check (try (foobarbaz#hello) (catch _ #f)) => #f)

   ;;; because it's in another namespace
   (check (drewc/build-test/new-project/new-hello-no-package#hello)
          => "Hello World... New Project!")
 #+end_src

 #+begin_src shell :results output code
   rm ~/.gerbil/foobarbaz*
   gxi -e '(load "~/src/gerbil-build/test/make1.ss")' \
       -e '(load "~/src/gerbil-build/test/test-make-gxc.ss")' \
       -e '(load "~/src/gerbil-build/test/test-compile-as-is.ss")' \
       -e '(load "~/src/gerbil-build/test/test-compile-set-id-to-foobarbaz.ss")' \
       -e '(make-ss "~/src/gerbil-build/test/new-project/new-hello-no-package.ss")'\
       -e '(load "~/src/gerbil-build/test/test-improper-namespace.ss")' \
 #+end_src

 #+begin_src shell
 # =>
 ... check (hello) is equal? to "Hello World... New Project!"
 ... check (try (foobarbaz#hello) (catch _ #f)) is equal? to #f
 ... check (drewc/build-test/new-project/new-hello-no-package#hello) is equal? to "Hello World... New Project!"
 #+end_src

 That's because of the ~module-namespace~.

 #+begin_src scheme :noweb-ref module-ns
   (def module-ns gx#module-context-ns)
   (def module-ns-set! gx#module-context-ns-set!)
 #+end_src

 If we set it, we should get it?

 #+begin_src scheme :tangle test/test-compile-set-id-and-ns-to-foobarbaz.ss
   (def test/new-project-hello-no-package-core-module
       (mod-core-module "new-hello-no-package" test-new-project-settings))

   (set! (module-id test/new-project-hello-no-package-module) 'foobarbaz)
   (set! (module-ns test/new-project-hello-no-package-module) "foobarbaz")
 #+end_src

 Here's the test ...


 #+begin_src scheme :tangle test/test-proper-namespace.ss
   (import :std/sugar :std/test :foobarbaz)
   (check (hello) => "Hello World... New Project!")

   ;;; This test passes!

   (check (foobarbaz#hello) => "Hello World... New Project!")

   ;;; because it's not in another namespace
   (check (try (drewc/build-test/new-project/new-hello-no-package#hello)
            (catch _ #f)) => #f)
 #+end_src

 ... but our test seems to fail. I think that's because the body is [[https://github.com/vyzo/gerbil/blob/master/src/gerbil/expander/module.ss#L173][set before]] we
 set the namespace.

 We'll nick that.

 #+begin_src scheme :noweb-ref prep-module-code
   (def (prep-module-code module code)
     (gx#core-quote-syntax (gx#core-cons '%#begin code)
    (gx#module-context-path module) module []))
 #+end_src

 And?

 #+begin_src scheme :tangle test/test-compile-set-body-foobarbaz.ss
   (def test/new-project-hello-no-package-core-module
       (mod-core-module "new-hello-no-package" test-new-project-settings))

   (set! (module-id test/new-project-hello-no-package-module) 'foobarbaz)
   (set! (module-ns test/new-project-hello-no-package-module) "foobarbaz")

   (set! (gx#&module-context-code test/new-project-hello-no-package-module)
     (prep-module-code test/new-project-hello-no-package-module (core-module-code test/new-project-hello-no-package-core-module)))

 #+end_src


 Nope, still doesn't work. That's ok, the code knows.

***** ~(def module-id [...]~

 #+begin_src scheme :noweb-ref inline-module-id
   (def module-name (path-strip-directory (path-strip-extension path)))
   (def module-id
     ;; If we provide _id, use it(d)!
     (or _id
       ;; If the core module package is the same as the mod that means we could not
       ;; find a package.
       (if (not (equal? module-name (symbol->string id))) id
         ;; If we do not have a toplevel package we are the id.
         (if (not _package) id
             ;; otherwise add it as the package as a supercontainer and return
             (string->symbol (path-expand module-name (symbol->string _package)))))))
  #+end_src

