doc/html/README.html

<li><a id="org0e4ac8a"></a><code>namespace:</code> and <code>prelude</code>: Two other things that are set for modules<br />
<div class="outline-text-5" id="text-org0e4ac8a">
<p>
The compiler also picks up those keywords from a parent so that even
setting the <code>module-id</code> can leave us with some surprises.
</p>

<p>
When we name a hello something else, we can import it as such.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/new-project-hello-no-package-core-module</span>
    (mod-core-module <span style="color: #2d9574;">"new-hello-no-package"</span> test-new-project-settings))

(<span style="color: #4f97d7; font-weight: bold;">set!</span> (module-id test/new-project-hello-no-package-module) <span style="color: #4f97d7; font-weight: bold;">'</span>foobarbaz)
</pre>
</div>


<p>
The issue is that the namespace is not set correctly. For example, the <code>test/hello.ss</code> file.
</p>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/test</span> <span style="color: #4f97d7;">:drewc/hello</span>)
(check (drewc/hello<span style="color: #4f97d7;">#</span>hello) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #2d9574;">"Hello World"</span>)
</pre>
</div>

<p>
But, for that <code>:foobarbaz</code> it's quite different.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/sugar</span> <span style="color: #4f97d7;">:std/test</span> <span style="color: #4f97d7;">:foobarbaz</span>)
(check (hello) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #2d9574;">"Hello World... New Project!"</span>)

<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">This test passes but it shoudn't</span>
(check (<span style="color: #4f97d7; font-weight: bold;">try</span> (foobarbaz<span style="color: #4f97d7;">#</span>hello) (<span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>)) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7;">#f</span>)

<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">because it's in another namespace</span>
(check (drewc/build-test/new-project/new-hello-no-package<span style="color: #4f97d7;">#</span>hello)
       <span style="color: #4f97d7;">=&gt;</span> <span style="color: #2d9574;">"Hello World... New Project!"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">rm ~/.gerbil/foobarbaz*
gxi -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/make1.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-make-gxc.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-compile-as-is.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-compile-set-id-to-foobarbaz.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(make-ss "~/src/gerbil-build/test/new-project/new-hello-no-package.ss")'</span><span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-improper-namespace.ss")'</span> <span style="color: #2d9574;">\</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt;</span>
... check <span style="color: #4f97d7;">(</span>hello<span style="color: #4f97d7;">)</span> is equal? to <span style="color: #2d9574;">"Hello World... New Project!"</span>
... check <span style="color: #4f97d7;">(</span>try <span style="color: #bc6ec5;">(</span>foobarbaz#hello<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>catch _ <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">f)) is equal? to #f</span>
... check <span style="color: #2d9574;">(</span>drewc/build-test/new-project/new-hello-no-package#hello<span style="color: #2d9574;">)</span> is equal? to <span style="color: #2d9574;">"Hello World... New Project!"</span>
</pre>
</div>

<p>
That's because of the <code>module-namespace</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">module-ns</span> gx<span style="color: #4f97d7;">#</span>module-context-ns)
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">module-ns-set!</span> gx<span style="color: #4f97d7;">#</span>module-context-ns-set!)
</pre>
</div>

<p>
If we set it, we should get it?
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/new-project-hello-no-package-core-module</span>
    (mod-core-module <span style="color: #2d9574;">"new-hello-no-package"</span> test-new-project-settings))

(<span style="color: #4f97d7; font-weight: bold;">set!</span> (module-id test/new-project-hello-no-package-module) <span style="color: #4f97d7; font-weight: bold;">'</span>foobarbaz)
(<span style="color: #4f97d7; font-weight: bold;">set!</span> (module-ns test/new-project-hello-no-package-module) <span style="color: #2d9574;">"foobarbaz"</span>)
</pre>
</div>

<p>
Here's the test &#x2026;
</p>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/sugar</span> <span style="color: #4f97d7;">:std/test</span> <span style="color: #4f97d7;">:foobarbaz</span>)
(check (hello) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #2d9574;">"Hello World... New Project!"</span>)

<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">This test passes!</span>

(check (foobarbaz<span style="color: #4f97d7;">#</span>hello) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #2d9574;">"Hello World... New Project!"</span>)

<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">because it's not in another namespace</span>
(check (<span style="color: #4f97d7; font-weight: bold;">try</span> (drewc/build-test/new-project/new-hello-no-package<span style="color: #4f97d7;">#</span>hello)
         (<span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>)) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7;">#f</span>)
</pre>
</div>

<p>
&#x2026; but our test seems to fail. I think that's because the body is <a href="https://github.com/vyzo/gerbil/blob/master/src/gerbil/expander/module.ss#L173">set before</a> we
set the namespace.
</p>

<p>
We'll nick that.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">prep-module-code</span> module code)
  (gx<span style="color: #4f97d7;">#</span>core-quote-syntax (gx<span style="color: #4f97d7;">#</span>core-cons <span style="color: #4f97d7; font-weight: bold;">'</span><span style="color: #4f97d7;">%#begin</span> code)
 (gx<span style="color: #4f97d7;">#</span>module-context-path module) module <span style="color: #7590db;">[]</span>))
</pre>
</div>

<p>
And?
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/new-project-hello-no-package-core-module</span>
    (mod-core-module <span style="color: #2d9574;">"new-hello-no-package"</span> test-new-project-settings))

(<span style="color: #4f97d7; font-weight: bold;">set!</span> (module-id test/new-project-hello-no-package-module) <span style="color: #4f97d7; font-weight: bold;">'</span>foobarbaz)
(<span style="color: #4f97d7; font-weight: bold;">set!</span> (module-ns test/new-project-hello-no-package-module) <span style="color: #2d9574;">"foobarbaz"</span>)

(<span style="color: #4f97d7; font-weight: bold;">set!</span> (gx<span style="color: #4f97d7;">#</span>&amp;module-context-code test/new-project-hello-no-package-module)
  (prep-module-code test/new-project-hello-no-package-module (core-module-code test/new-project-hello-no-package-core-module)))

</pre>
</div>


<p>
Nope, still doesn't work. That's ok, the code knows.
</p>
</div>

<ul class="org-ul">
<li><a id="orgce78632"></a><code>(def module-id [...]</code><br />
<div class="outline-text-6" id="text-orgce78632">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">module-name</span> (path-strip-directory (path-strip-extension path)))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">module-id</span>
  <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">If we provide _id, use it(d)!</span>
  (<span style="color: #4f97d7; font-weight: bold;">or</span> <span style="color: #4f97d7;">_</span>id
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">If the core module package is the same as the mod that means we could not</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">find a package.</span>
    (<span style="color: #4f97d7; font-weight: bold;">if</span> (<span style="color: #4f97d7; font-weight: bold;">not</span> (equal? module-name (symbol-&gt;string id))) id
      <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">If we do not have a toplevel package we are the id.</span>
      (<span style="color: #4f97d7; font-weight: bold;">if</span> (<span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7;">_</span>package) id
          <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">otherwise add it as the package as a supercontainer and return</span>
          (string-&gt;symbol (path-expand module-name (symbol-&gt;string <span style="color: #4f97d7;">_</span>package)))))))
</pre>
</div>
</div>
</li>
