README.org
***** Time to test!


 #+begin_src scheme :tangle test/test-compile-prep-foobarbaz.ss
   (import :std/test)
   (def test/foobarbaz-module
     (prep-import-module
      (source-path "new-hello-no-package" ".ss" test-new-project-settings)
      srcdir: (settings-srcdir test-new-project-settings)
      id: 'foobarbaz #t))

   (check (module-id test/foobarbaz-module) => 'foobarbaz)


 #+end_src

 #+begin_src shell :results output code
   rm ~/.gerbil/lib/foobarbaz*
   gxi -e '(load "~/src/gerbil-build/test/make1.ss")' \
       -e '(load "~/src/gerbil-build/test/test-make-gxc.ss")' \
       -e '(load "~/src/gerbil-build/test/import.ss")' \
       -e '(load "~/src/gerbil-build/test/test-compile-as-is.ss")' \
       -e '(load "~/src/gerbil-build/test/test-compile-prep-foobarbaz.ss")' \
       -e '(make-ss "~/src/gerbil-build/test/new-project/new-hello-no-package.ss")'\
       -e '(load "~/src/gerbil-build/test/test-proper-namespace.ss")' \
 #+end_src


 Yes! It worked.

 #+begin_src shell
 # =>
 ... check (hello) is equal? to "Hello World... New Project!"
 ... check (foobarbaz#hello) is equal? to "Hello World... New Project!"
 ... check (try (drewc/build-test/new-project/new-hello-no-package#hello) (catch _ #f)) is equal? to #f
 #+end_src


 #+begin_src scheme :tangle "./test/new-project/sub/foo.ss" :mkdirp yes
 (export hello)
 (def (hello) "Hello World... New Project!")
 #+end_src
 #+RESULTS:


