doc/html/README.html



<li><a id="orgea4bf5c"></a>Time to test!<br />
<div class="outline-text-6" id="text-orgea4bf5c">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/test</span>)
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/foobarbaz-module</span>
  (prep-import-module
   (source-path <span style="color: #2d9574;">"new-hello-no-package"</span> <span style="color: #2d9574;">".ss"</span> test-new-project-settings)
   <span style="color: #4f97d7;">srcdir:</span> (settings-srcdir test-new-project-settings)
   <span style="color: #4f97d7;">id:</span> <span style="color: #4f97d7; font-weight: bold;">'</span>foobarbaz <span style="color: #4f97d7;">#t</span>))

(check (module-id test/foobarbaz-module) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>foobarbaz)


</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">rm ~/.gerbil/lib/foobarbaz*
gxi -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/make1.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-make-gxc.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/import.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-compile-as-is.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-compile-prep-foobarbaz.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(make-ss "~/src/gerbil-build/test/new-project/new-hello-no-package.ss")'</span><span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-proper-namespace.ss")'</span> <span style="color: #2d9574;">\</span>
</pre>
</div>


<p>
Yes! It worked.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt;</span>
... check <span style="color: #4f97d7;">(</span>hello<span style="color: #4f97d7;">)</span> is equal? to <span style="color: #2d9574;">"Hello World... New Project!"</span>
... check <span style="color: #4f97d7;">(</span>foobarbaz#hello<span style="color: #4f97d7;">)</span> is equal? to <span style="color: #2d9574;">"Hello World... New Project!"</span>
... check <span style="color: #4f97d7;">(</span>try <span style="color: #bc6ec5;">(</span>drewc/build-test/new-project/new-hello-no-package#hello<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span>catch _ <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">f)) is equal? to #f</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">export</span> hello)
(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">hello</span>) <span style="color: #2d9574;">"Hello World... New Project!"</span>)
</pre>
</div>
</div>
</li>
