README.org
***** Prelude and Postlude: Putting it all together

      The only thing we're missing is a way to set a prelude in the make
      settings. In fact, we don't set the namespace there either.

      Let's unite things. We'll create a ~settings-gerbil.pkg~ accessor.

 #+begin_src scheme :noweb-ref unite-settings-struct
   ;;; Settings: see details in doc/reference/make.md
   (defstruct settings
     (srcdir libdir bindir force optimize debug static
             static-debug verbose build-deps parallelize gerbil.pkg)
     transparent: #t constructor: :init!)

   (def current-make-settings (make-parameter #f))
 #+end_src


 #+begin_src scheme :noweb-ref unite-settings-init
   (def (read-gerbil.pkg-plist srcdir)
     (with-catch
      false (lambda () (call-with-input-file (path-expand "gerbil.pkg" srcdir) read))))

   (defmethod {:init! settings}
    (lambda (self
        srcdir: (srcdir_ #f) libdir: (libdir_ #f) bindir: (bindir_ #f)
        gerbil.pkg: (gxpkg_ #f) force: (force? #f)
        optimize: (optimize #t) debug: (debug 'env)
        static: (static #t) static-debug: (static-debug #f)
        verbose: (verbose #f) build-deps: (build-deps_ #f)
        parallelize: (parallelize_ #t))
      (def gerbil-path (getenv "GERBIL_PATH" "~/.gerbil"))
      (def srcdir (or srcdir_ (error "srcdir must be specified")))
      (def gerbil.pkg (or gxpkg_ (read-gerbil.pkg-plist srcdir_ )))
      (def libdir (or libdir_ (path-expand "lib" gerbil-path)))
      (def bindir (or bindir_ (path-expand "bin" gerbil-path)))
      (def build-deps (path-expand (or build-deps_ "build-deps") srcdir))
      (def parallelize (if (eq? parallelize_ #t) (gerbil-build-cores) (or parallelize_ 0)))
      (struct-instance-init!
        self
        srcdir libdir bindir force? optimize debug static static-debug verbose build-deps
        parallelize gerbil.pkg))
      rebind: #t)

   (def (settings-gerbil.pkg-pgetq s k (nope #f))
     (let (plist (settings-gerbil.pkg s))
       (if (not plist) nope (pgetq plist k nope))))

   (def settings-package (cut settings-gerbil.pkg-pgetq <> package:))
   (def settings-namespace (cut settings-gerbil.pkg-pgetq <> namespace:))
   (def settings-prelude (cut settings-gerbil.pkg-pgetq <> prelude:))
 #+end_src


 Now that we've got that taken care of, let's do preludes.

"As of Gerbil ~v0.16-DEV-259-g13646d64~ gerbil comes with a custom language
prelude, ~:gerbil/polydactyl~, that treats square brackets as plain parentheses
instead of the reader expanding them to @list forms. The language is otherwise
the same as ~:gerbil/core~."
--https://cons.io/guide/intro.html#core-gerbil-variants


 #+begin_src scheme :tangle "./test/prelude/hello.ss" :mkdirp yes
 (export hello)

 (def (hello) [list . '("Hello World" 2 3)])
 #+end_src

Without any prelude, that should return a list with a procedure as its member.

#+begin_src scheme :tangle "./test/prelude-no-prelude.ss"
    (def test-no-prelude-settings (settings srcdir: "~/src/gerbil-build/test/prelude"))

    (def test/hello-no-prelude-module
      (prep-import-module
       (source-path "hello" ".ss" test-no-prelude-settings)
       srcdir: (settings-srcdir test-no-prelude-settings)
       package: 'no-prelude
       namespace: 'np))
#+end_src

#+begin_src scheme :tangle ./test/test-prelude-no-prelude.ss
  (import :no-prelude/hello :std/test)
  (check ((car (hello)) (cadr (hello))) => '("Hello World"))
#+end_src

It works, of course, because this is nothing new.

 #+begin_src shell
 ... check ((car (np#hello))) is equal? to "Hello World"
 #+end_src

Let's set a prelude.

 #+begin_src scheme :tangle "./test/prelude/prehello.ss" :mkdirp yes
 #lang :gerbil/polydactyl
 ;;; does not work? prelude: :gerbil/polydactyl
 (export hello)

 (def (hello) [list . ("Hello World" 2 3)])
 #+end_src

#+begin_src scheme :tangle "./test/no-prelude-prelude.ss"
  (def test/hello-no-prelude-prelude-module
    (prep-import-module
     (source-path "prehello" ".ss" test-no-prelude-settings)
     srcdir: (settings-srcdir test-no-prelude-settings)
     package: 'no-prelude
     namespace: 'np))
#+end_src

#+begin_src scheme :tangle ./test/test-no-prelude-prehello.ss
  (import :no-prelude/prehello :std/test)
  (check (car (hello)) =>"Hello World")
#+end_src


 #+begin_src shell :results output code
   rm -rf ~/.gerbil/lib/no-prelude ~/.gerbil/lib/drewc/build-test/prelude/
   gxi -e '(load "~/src/gerbil-build/test/make1.ss")' \
       -e '(load "~/src/gerbil-build/test/test-make-gxc.ss")' \
       -e '(load "~/src/gerbil-build/test/import.ss")' \
       -e '(load "~/src/gerbil-build/test/prelude-no-prelude.ss")' \
       -e '(load "~/src/gerbil-build/test/no-prelude-prelude.ss")' \
       -e '(make-ss "~/src/gerbil-build/test/prelude/prehello.ss")'\
       -e '(load "~/src/gerbil-build/test/test-no-prelude-prehello.ss")'
 #+end_src

 #+RESULTS:
 #+begin_src shell
 compile ~/src/gerbil-build/test/prelude/prehello.ss
 compile no-prelude/prehello
 compile ~/.gerbil/lib/no-prelude/prehello__0.scm
 invoke gsc (gsc -:i8,f8,-8,t8 ~/.gerbil/lib/no-prelude/prehello__0.scm)
 compile ~/.gerbil/lib/no-prelude/prehello__rt.scm
 invoke gsc (gsc -:i8,f8,-8,t8 ~/.gerbil/lib/no-prelude/prehello__rt.scm)
 compile ~/.gerbil/lib/no-prelude/prehello.ssi
 ... check (car (hello)) is equal? to "Hello World"
 #+end_src

While it works, it turns out the ~#lang~ and ~prelude:~ are totally different
things. While that is a good thing to learn, it also means the build script need
not worry for now.

 #+begin_src shell
 ... check (car (hello)) is equal? to "Hello World"
 #+end_src


