doc/html/README.html


<li><a id="orge80a98b"></a>Prelude and Postlude: Putting it all together<br />
<div class="outline-text-6" id="text-orge80a98b">
<p>
The only thing we're missing is a way to set a prelude in the make
settings. In fact, we don't set the namespace there either.
</p>

<p>
Let's unite things. We'll create a <code>settings-gerbil.pkg</code> accessor.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">Settings: see details in doc/reference/make.md</span>
(<span style="color: #4f97d7; font-weight: bold;">defstruct</span> <span style="color: #ce537a; font-weight: bold;">settings</span>
  (srcdir libdir bindir force optimize debug static
          static-debug verbose build-deps parallelize gerbil.pkg)
  <span style="color: #4f97d7;">transparent:</span> <span style="color: #4f97d7;">#t</span> <span style="color: #4f97d7;">constructor:</span> <span style="color: #4f97d7;">:init!</span>)

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">current-make-settings</span> (make-parameter <span style="color: #4f97d7;">#f</span>))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">read-gerbil.pkg-plist</span> srcdir)
  (with-catch
   false (<span style="color: #4f97d7; font-weight: bold;">lambda</span> () (<span style="color: #4f97d7; font-weight: bold;">call-with-input-file</span> (path-expand <span style="color: #2d9574;">"gerbil.pkg"</span> srcdir) read))))

(<span style="color: #4f97d7; font-weight: bold;">defmethod</span> <span style="color: #7590db;">{</span><span style="color: #4f97d7;">:init!</span> settings<span style="color: #7590db;">}</span>
 (<span style="color: #4f97d7; font-weight: bold;">lambda</span> (self
     <span style="color: #4f97d7;">srcdir:</span> (srcdir<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>) <span style="color: #4f97d7;">libdir:</span> (libdir<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>) <span style="color: #4f97d7;">bindir:</span> (bindir<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>)
     <span style="color: #4f97d7;">gerbil.pkg:</span> (gxpkg<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>) <span style="color: #4f97d7;">force:</span> (force? <span style="color: #4f97d7;">#f</span>)
     <span style="color: #4f97d7;">optimize:</span> (optimize <span style="color: #4f97d7;">#t</span>) <span style="color: #4f97d7;">debug:</span> (debug <span style="color: #4f97d7; font-weight: bold;">'</span>env)
     <span style="color: #4f97d7;">static:</span> (static <span style="color: #4f97d7;">#t</span>) <span style="color: #4f97d7;">static-debug:</span> (static-debug <span style="color: #4f97d7;">#f</span>)
     <span style="color: #4f97d7;">verbose:</span> (verbose <span style="color: #4f97d7;">#f</span>) <span style="color: #4f97d7;">build-deps:</span> (build-deps<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#f</span>)
     <span style="color: #4f97d7;">parallelize:</span> (parallelize<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#t</span>))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">gerbil-path</span> (getenv <span style="color: #2d9574;">"GERBIL_PATH"</span> <span style="color: #2d9574;">"~/.gerbil"</span>))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">srcdir</span> (<span style="color: #4f97d7; font-weight: bold;">or</span> srcdir<span style="color: #4f97d7;">_</span> (<span style="color: #4f97d7; font-weight: bold;">error</span> <span style="color: #2d9574;">"srcdir must be specified"</span>)))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">gerbil.pkg</span> (<span style="color: #4f97d7; font-weight: bold;">or</span> gxpkg<span style="color: #4f97d7;">_</span> (read-gerbil.pkg-plist srcdir<span style="color: #4f97d7;">_</span> )))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">libdir</span> (<span style="color: #4f97d7; font-weight: bold;">or</span> libdir<span style="color: #4f97d7;">_</span> (path-expand <span style="color: #2d9574;">"lib"</span> gerbil-path)))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bindir</span> (<span style="color: #4f97d7; font-weight: bold;">or</span> bindir<span style="color: #4f97d7;">_</span> (path-expand <span style="color: #2d9574;">"bin"</span> gerbil-path)))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">build-deps</span> (path-expand (<span style="color: #4f97d7; font-weight: bold;">or</span> build-deps<span style="color: #4f97d7;">_</span> <span style="color: #2d9574;">"build-deps"</span>) srcdir))
   (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">parallelize</span> (<span style="color: #4f97d7; font-weight: bold;">if</span> (eq? parallelize<span style="color: #4f97d7;">_</span> <span style="color: #4f97d7;">#t</span>) (gerbil-build-cores) (<span style="color: #4f97d7; font-weight: bold;">or</span> parallelize<span style="color: #4f97d7;">_</span> 0)))
   (struct-instance-init!
     self
     srcdir libdir bindir force? optimize debug static static-debug verbose build-deps
     parallelize gerbil.pkg))
   <span style="color: #4f97d7;">rebind:</span> <span style="color: #4f97d7;">#t</span>)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">settings-gerbil.pkg-pgetq</span> s k (nope <span style="color: #4f97d7;">#f</span>))
  (<span style="color: #4f97d7; font-weight: bold;">let</span> (plist (settings-gerbil.pkg s))
    (<span style="color: #4f97d7; font-weight: bold;">if</span> (<span style="color: #4f97d7; font-weight: bold;">not</span> plist) nope (pgetq plist k nope))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">settings-package</span> (<span style="color: #4f97d7; font-weight: bold;">cut</span> settings-gerbil.pkg-pgetq <span style="color: #4f97d7;">&lt;&gt;</span> <span style="color: #4f97d7;">package:</span>))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">settings-namespace</span> (<span style="color: #4f97d7; font-weight: bold;">cut</span> settings-gerbil.pkg-pgetq <span style="color: #4f97d7;">&lt;&gt;</span> <span style="color: #4f97d7;">namespace:</span>))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">settings-prelude</span> (<span style="color: #4f97d7; font-weight: bold;">cut</span> settings-gerbil.pkg-pgetq <span style="color: #4f97d7;">&lt;&gt;</span> <span style="color: #4f97d7;">prelude:</span>))
</pre>
</div>


<p>
Now that we've got that taken care of, let's do preludes.
</p>

<p>
"As of Gerbil <code>v0.16-DEV-259-g13646d64</code> gerbil comes with a custom language
prelude, <code>:gerbil/polydactyl</code>, that treats square brackets as plain parentheses
instead of the reader expanding them to @list forms. The language is otherwise
the same as <code>:gerbil/core</code>."
--<a href="https://cons.io/guide/intro.html#core-gerbil-variants">https://cons.io/guide/intro.html#core-gerbil-variants</a>
</p>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">export</span> hello)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">hello</span>) <span style="color: #7590db;">[</span>list . <span style="color: #4f97d7; font-weight: bold;">'</span>(<span style="color: #2d9574;">"Hello World"</span> 2 3)<span style="color: #7590db;">]</span>)
</pre>
</div>

<p>
Without any prelude, that should return a list with a procedure as its member.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test-no-prelude-settings</span> (settings <span style="color: #4f97d7;">srcdir:</span> <span style="color: #2d9574;">"~/src/gerbil-build/test/prelude"</span>))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/hello-no-prelude-module</span>
  (prep-import-module
   (source-path <span style="color: #2d9574;">"hello"</span> <span style="color: #2d9574;">".ss"</span> test-no-prelude-settings)
   <span style="color: #4f97d7;">srcdir:</span> (settings-srcdir test-no-prelude-settings)
   <span style="color: #4f97d7;">package:</span> <span style="color: #4f97d7; font-weight: bold;">'</span>no-prelude
   <span style="color: #4f97d7;">namespace:</span> <span style="color: #4f97d7; font-weight: bold;">'</span>np))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:no-prelude/hello</span> <span style="color: #4f97d7;">:std/test</span>)
(check ((car (hello)) (cadr (hello))) <span style="color: #4f97d7;">=&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>(<span style="color: #2d9574;">"Hello World"</span>))
</pre>
</div>

<p>
It works, of course, because this is nothing new.
</p>

<div class="org-src-container">
<pre class="src src-shell">... check <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>car <span style="color: #2d9574;">(</span>np#hello<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> is equal? to <span style="color: #2d9574;">"Hello World"</span>
</pre>
</div>

<p>
Let's set a prelude.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">#</span>lang <span style="color: #4f97d7;">:gerbil/polydactyl</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">does not work? prelude: :gerbil/polydactyl</span>
(<span style="color: #4f97d7; font-weight: bold;">export</span> hello)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">hello</span>) <span style="color: #7590db;">[</span>list . (<span style="color: #2d9574;">"Hello World"</span> 2 3)<span style="color: #7590db;">]</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test/hello-no-prelude-prelude-module</span>
  (prep-import-module
   (source-path <span style="color: #2d9574;">"prehello"</span> <span style="color: #2d9574;">".ss"</span> test-no-prelude-settings)
   <span style="color: #4f97d7;">srcdir:</span> (settings-srcdir test-no-prelude-settings)
   <span style="color: #4f97d7;">package:</span> <span style="color: #4f97d7; font-weight: bold;">'</span>no-prelude
   <span style="color: #4f97d7;">namespace:</span> <span style="color: #4f97d7; font-weight: bold;">'</span>np))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:no-prelude/prehello</span> <span style="color: #4f97d7;">:std/test</span>)
(check (car (hello)) <span style="color: #4f97d7;">=&gt;</span><span style="color: #2d9574;">"Hello World"</span>)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-shell">rm -rf ~/.gerbil/lib/no-prelude ~/.gerbil/lib/drewc/build-test/prelude/
gxi -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/make1.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-make-gxc.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/import.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/prelude-no-prelude.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/no-prelude-prelude.ss")'</span> <span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(make-ss "~/src/gerbil-build/test/prelude/prehello.ss")'</span><span style="color: #2d9574;">\</span>
    -e <span style="color: #2d9574;">'(load "~/src/gerbil-build/test/test-no-prelude-prehello.ss")'</span>
</pre>
</div>

<p>
While it works, it turns out the <code>#lang</code> and <code>prelude:</code> are totally different
things. While that is a good thing to learn, it also means the build script need
not worry for now.
</p>

<div class="org-src-container">
<pre class="src src-shell">... check <span style="color: #4f97d7;">(</span>car <span style="color: #bc6ec5;">(</span>hello<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> is equal? to <span style="color: #2d9574;">"Hello World"</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
