README.org
*** ~mod~'s: Talking 'bout this generation
Time for the ~mod~'s to rumble. What is a ~mod~? A mod is a string specifying a
file's name and relative location.

With a ~mod~ we can get an ~expander-module~ which has an
~expander-module-relative-library-directory~.

That's what we need for ~library-path~.

#+begin_src scheme :noweb-ref library-path
  (def (library-path mod ext (settings (current-make-settings)))
    (let (expm (mod-expander-module mod settings))
      (path-expand (path-force-extension mod ext)
                   (path-expand (expander-module-relative-library-directory expm)
                                (settings-libdir settings)))))
#+end_src

#+begin_src scheme :tangle "make/mod.ss" :noweb yes
  package: std/make
  (import ./expander-module :std/make/settings :std/misc/func :std/misc/path)
  (export #t)

  <<source-path>>

  (def mod-expander-modules (make-hash-table)) ;;; cache
  (def (mod-expander-module mod (settings (current-make-settings)) (reload? #f))
    (let (v (hash-ref mod-expander-modules mod (void)))
      (if (and (not (void? v)) (not reload?)) v
          (let* ((src (source-path mod ".ss" settings))
                 (m (and (file-exists? src)
                         (prep-import-module
                          src
                          srcdir: (settings-srcdir settings)
                          package: (settings-package settings)
                          namespace: (settings-namespace settings)
                          reload?))))
            (begin0 m (hash-put! mod-expander-modules mod m))))))

  <<library-path>>

  (def (static-file-path file settings)
    (let* ((libdir (settings-libdir settings))
           (staticdir (path-expand "static" libdir))
           (filename (path-strip-directory file)))
      (path-expand filename staticdir)))
 #+end_src


