doc/html/README.html

<div id="outline-container-org669cb50" class="outline-4">
<h4 id="org669cb50"><code>mod</code>'s: Talking 'bout this generation</h4>
<div class="outline-text-4" id="text-org669cb50">
<p>
Time for the <code>mod</code>'s to rumble. What is a <code>mod</code>? A mod is a string specifying a
file's name and relative location.
</p>

<p>
With a <code>mod</code> we can get an <code>expander-module</code> which has an
<code>expander-module-relative-library-directory</code>.
</p>

<p>
That's what we need for <code>library-path</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">library-path</span> mod ext (settings (current-make-settings)))
  (<span style="color: #4f97d7; font-weight: bold;">let</span> (expm (mod-expander-module mod settings))
    (path-expand (path-force-extension mod ext)
                 (path-expand (expander-module-relative-library-directory expm)
                              (settings-libdir settings)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">package:</span> std/make
(<span style="color: #4f97d7; font-weight: bold;">import</span> ./expander-module <span style="color: #4f97d7;">:std/make/settings</span> <span style="color: #4f97d7;">:std/misc/func</span> <span style="color: #4f97d7;">:std/misc/path</span>)
(<span style="color: #4f97d7; font-weight: bold;">export</span> <span style="color: #4f97d7;">#t</span>)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">source-path</span> mod ext settings)
  (path-expand (path-default-extension mod ext) (settings-srcdir settings)))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">mod-expander-modules</span> (make-hash-table)) <span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">cache</span>
(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">mod-expander-module</span> mod (settings (current-make-settings)) (reload? <span style="color: #4f97d7;">#f</span>))
  (<span style="color: #4f97d7; font-weight: bold;">let</span> (v (hash-ref mod-expander-modules mod (void)))
    (<span style="color: #4f97d7; font-weight: bold;">if</span> (<span style="color: #4f97d7; font-weight: bold;">and</span> (<span style="color: #4f97d7; font-weight: bold;">not</span> (void? v)) (<span style="color: #4f97d7; font-weight: bold;">not</span> reload?)) v
        (<span style="color: #4f97d7; font-weight: bold;">let*</span> ((src (source-path mod <span style="color: #2d9574;">".ss"</span> settings))
               (m (<span style="color: #4f97d7; font-weight: bold;">and</span> (file-exists? src)
                       (prep-import-module
                        src
                        <span style="color: #4f97d7;">srcdir:</span> (settings-srcdir settings)
                        <span style="color: #4f97d7;">package:</span> (settings-package settings)
                        <span style="color: #4f97d7;">namespace:</span> (settings-namespace settings)
                        reload?))))
          (<span style="color: #4f97d7; font-weight: bold;">begin0</span> m (hash-put! mod-expander-modules mod m))))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">library-path</span> mod ext (settings (current-make-settings)))
  (<span style="color: #4f97d7; font-weight: bold;">let</span> (expm (mod-expander-module mod settings))
    (path-expand (path-force-extension mod ext)
                 (path-expand (expander-module-relative-library-directory expm)
                              (settings-libdir settings)))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">static-file-path</span> file settings)
  (<span style="color: #4f97d7; font-weight: bold;">let*</span> ((libdir (settings-libdir settings))
         (staticdir (path-expand <span style="color: #2d9574;">"static"</span> libdir))
         (filename (path-strip-directory file)))
    (path-expand filename staticdir)))
</pre>
</div>
</div>
</div>
