README.org
*** bootstrap


Going to have an attempt at building that before there's a function to build it,
as we have all along.

Because we cannot build ourselves we bootstrap our build.

#+begin_src scheme :tangle ./test/test-bootstrap1.ss :noweb yes
  (import :std/misc/path :std/misc/list :gerbil/compiler)

  <<unite-settings-struct>>

  <<settings-verbose>=?>>
  <<gerbil-build-cores>>

  <<unite-settings-init>>

  <<prep-import-module>>

  <<source-path>>

  <<base-outputs>>

  <<gsc-compile-opts>>

  <<gxc-compile-file>>

  (def (set-loadpath settings)
    (let* ((loadpath (getenv "GERBIL_LOAD_PATH" #f))
           (loapath (if loadpath (string-append loadpath ":") ""))
           (loadpath (string-append (or loadpath "") (settings-srcdir settings))))
      (setenv "GERBIL_LOAD_PATH" loadpath)))

  (def (prep-mod mod settings (reload? #f))
    (prep-import-module                   ;
     (source-path mod ".ss" settings)
     srcdir: (settings-srcdir settings)
     package: (settings-package settings)
     namespace: (settings-namespace settings)
     reload?))

  (def (build-mods mods (srcdir (path-normalize (path-directory (this-source-file)))))
    (def settings (make-settings srcdir: srcdir verbose: #t))
    (set-loadpath settings)

    (def (build-mod mod) (message "building " mod)
      (prep-mod mod settings)
      (gxc-compile-file mod [] settings))


    (message "Builings Mods " mods)

    (let build ((ms mods))
      (unless (null? ms)
        (build-mod (car ms)) (build (cdr ms)))))
#+end_src

#+begin_src scheme :tangle ./test/build1.ss :noweb yes :shebang "#!/usr/bin/env gxi"

  (def +this-file+ (this-source-file))
  (def +this-srcdir+ (path-normalize (path-directory +this-file+)))

  (current-directory +this-srcdir+)
  (load "test-bootstrap1.ss")

  (def mods
    '("make/base" "make/settings" "make/expander-module" "make/mod"))

  (def +mod-src-dir+ (path-expand ".." +this-srcdir+ ))

  (current-directory +mod-src-dir+)

  (message "srcdir " +mod-src-dir+)

  (build-mods mods +mod-src-dir+)

#+end_src


 #+begin_src shell :results output code
   rm -rf ~/.gerbil/lib/std/make/*
   ~/src/gerbil-build/test/build1.ss
 #+end_src


 #+begin_src shell
 srcdir /home/user/src/gerbil-build/test/..
 Builings Mods (make/base make/settings make/expander-module make/mod)
 building make/base
 ... compile-file make/base
 building make/settings
 ... compile-file make/settings
 building make/expander-module
 ... compile-file make/expander-module
 building make/mod
 ... compile-file make/mod
 #+end_src


