doc/html/README.html

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">build-mods</span> mods (srcdir (path-normalize (path-directory (this-source-file)))))
  (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">settings</span> (make-settings <span style="color: #4f97d7;">srcdir:</span> srcdir <span style="color: #4f97d7;">verbose:</span> <span style="color: #4f97d7;">#t</span>))
  (set-loadpath settings)

  (<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">build-mod</span> mod) (message <span style="color: #2d9574;">"building "</span> mod)
    (prep-mod mod settings)
    (gxc-compile-file mod <span style="color: #7590db;">[]</span> settings))


  (message <span style="color: #2d9574;">"Builings Mods "</span> mods)

  (<span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5; font-weight: bold;">build</span> ((ms mods))
    (<span style="color: #4f97d7; font-weight: bold;">unless</span> (null? ms)
      (build-mod (car ms)) (build (cdr ms)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">+this-file+</span> (this-source-file))
(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">+this-srcdir+</span> (path-normalize (path-directory +this-file+)))

(current-directory +this-srcdir+)
(load <span style="color: #2d9574;">"test-bootstrap1.ss"</span>)

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">mods</span>
  <span style="color: #4f97d7; font-weight: bold;">'</span>(<span style="color: #2d9574;">"make/base"</span> <span style="color: #2d9574;">"make/settings"</span> <span style="color: #2d9574;">"make/expander-module"</span> <span style="color: #2d9574;">"make/mod"</span>))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">+mod-src-dir+</span> (path-expand <span style="color: #2d9574;">".."</span> +this-srcdir+ ))

(current-directory +mod-src-dir+)

(message <span style="color: #2d9574;">"srcdir "</span> +mod-src-dir+)

(build-mods mods +mod-src-dir+)

</pre>
</div>


<div class="org-src-container">
<pre class="src src-shell">rm -rf ~/.gerbil/lib/std/make/*
~/src/gerbil-build/test/build1.ss
</pre>
</div>


<div class="org-src-container">
<pre class="src src-shell">srcdir /home/user/src/gerbil-build/test/..
Builings Mods <span style="color: #4f97d7;">(</span>make/base make/settings make/expander-module make/mod<span style="color: #4f97d7;">)</span>
building make/base
... compile-file make/base
building make/settings
... compile-file make/settings
building make/expander-module
... compile-file make/expander-module
building make/mod
... compile-file make/mod
</pre>
</div>
</div>
</div>
</div>
