doc/html/README.html

<li><a id="orgfc35946"></a><code>make/spec</code>: Specifications<br />
<div class="outline-text-5" id="text-orgfc35946">
<p>
Essentially we want a short form syntax for making <b>make/makefiles</b>, aka
<code>build.ss</code>.
</p>

<p>
Specs are built.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-build</span> spec settings)
  (<span style="color: #4f97d7; font-weight: bold;">match</span> spec
    ((<span style="color: #4f97d7;">?</span> string? modf)
     (gxc-compile modf <span style="color: #4f97d7;">#f</span> settings <span style="color: #4f97d7;">#t</span>))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">gxc:</span> modf . opts<span style="color: #7590db;">]</span>
     (gxc-compile modf opts settings <span style="color: #4f97d7;">#t</span>))
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([gsc: modf . opts]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(gsc-compile modf opts settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([ssi: modf . submodules]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(for-each (cut build &lt;&gt; settings) submodules)</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(compile-ssi modf '() settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([exe: modf . opts]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(compile-exe modf opts settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([static-exe: modf . opts]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(compile-static-exe modf opts settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([static-include: file]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(copy-static file settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([copy: file]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(copy-compiled file settings))</span>
    (<span style="color: #4f97d7; font-weight: bold;">else</span>
     (<span style="color: #4f97d7; font-weight: bold;">error</span> <span style="color: #2d9574;">"Bad buildspec"</span> spec))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">package:</span> std/make
(<span style="color: #4f97d7; font-weight: bold;">import</span> ./mod ./gxc <span style="color: #4f97d7;">:std/srfi/1</span>)
(<span style="color: #4f97d7; font-weight: bold;">export</span> <span style="color: #4f97d7;">#t</span>)
<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">Build item spec</span>
(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-type</span> spec)
  (<span style="color: #4f97d7; font-weight: bold;">match</span> spec
    ((<span style="color: #4f97d7;">?</span> string? <span style="color: #4f97d7;">_</span>) <span style="color: #4f97d7;">gxc:</span>)
    (<span style="color: #7590db;">[</span>(<span style="color: #4f97d7;">?</span> keyword? type) . <span style="color: #4f97d7;">_</span><span style="color: #7590db;">]</span> type)
    (<span style="color: #4f97d7; font-weight: bold;">else</span> (<span style="color: #4f97d7; font-weight: bold;">error</span> <span style="color: #2d9574;">"Bad buildspec"</span> spec))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-file</span> spec settings)
  (<span style="color: #4f97d7; font-weight: bold;">match</span> spec
    ((<span style="color: #4f97d7;">?</span> string? modf) (source-path modf <span style="color: #2d9574;">".ss"</span> settings))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">gxc:</span> modf . opts<span style="color: #7590db;">]</span> (source-path modf <span style="color: #2d9574;">".ss"</span> settings))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">gsc:</span> modf . opts<span style="color: #7590db;">]</span> (source-path modf <span style="color: #2d9574;">".scm"</span> settings))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">ssi:</span> modf . deps<span style="color: #7590db;">]</span> (source-path modf <span style="color: #2d9574;">".ssi"</span> settings))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">exe:</span> modf . opts<span style="color: #7590db;">]</span> (source-path modf <span style="color: #2d9574;">".ss"</span> settings))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">static-exe:</span> modf . opts<span style="color: #7590db;">]</span> (source-path modf <span style="color: #2d9574;">".ss"</span> settings))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">static-include:</span> file<span style="color: #7590db;">]</span> (static-file-path file settings))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">copy:</span> file<span style="color: #7590db;">]</span> file)
    (<span style="color: #4f97d7; font-weight: bold;">else</span>
     (<span style="color: #4f97d7; font-weight: bold;">error</span> <span style="color: #2d9574;">"Bad buildspec"</span> spec))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-inputs</span> spec settings)
  <span style="color: #7590db;">[</span>(spec-file spec settings) (spec-extra-inputs spec settings) <span style="color: #4f97d7;">...</span><span style="color: #7590db;">]</span>)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-extra-inputs</span> spec settings)
  (<span style="color: #4f97d7; font-weight: bold;">match</span> spec
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">gxc:</span> . <span style="color: #4f97d7;">_</span><span style="color: #7590db;">]</span> (pgetq <span style="color: #4f97d7;">extra-inputs:</span> (spec-plist spec) <span style="color: #7590db;">[]</span>))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">gsc:</span> . <span style="color: #4f97d7;">_</span><span style="color: #7590db;">]</span> (pgetq <span style="color: #4f97d7;">extra-inputs:</span> (spec-plist spec) <span style="color: #7590db;">[]</span>))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">ssi:</span> <span style="color: #4f97d7;">_</span> . submodules<span style="color: #7590db;">]</span> (append-map (<span style="color: #4f97d7; font-weight: bold;">cut</span> spec-inputs <span style="color: #4f97d7;">&lt;&gt;</span> settings) submodules))
    (<span style="color: #4f97d7;">_</span> <span style="color: #7590db;">[]</span>)))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-plist</span> spec)
  (<span style="color: #4f97d7; font-weight: bold;">match</span> spec
    (<span style="color: #7590db;">[</span>(<span style="color: #4f97d7;">?</span> (<span style="color: #4f97d7; font-weight: bold;">cut</span> member <span style="color: #4f97d7;">&lt;&gt;</span> <span style="color: #4f97d7; font-weight: bold;">'</span>(<span style="color: #4f97d7;">gxc:</span> <span style="color: #4f97d7;">gsc:</span>))) <span style="color: #4f97d7;">_</span> <span style="color: #7590db;">[</span>plist <span style="color: #4f97d7;">...</span><span style="color: #7590db;">]</span> . <span style="color: #4f97d7;">_</span><span style="color: #7590db;">]</span> plist)
    (<span style="color: #4f97d7;">_</span> <span style="color: #7590db;">[]</span>)))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-outputs</span> spec settings)
  (<span style="color: #4f97d7; font-weight: bold;">match</span> spec
    ((<span style="color: #4f97d7;">?</span> string? modf) (gxc-outputs modf <span style="color: #4f97d7;">#f</span> settings))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">gxc:</span> modf . opts<span style="color: #7590db;">]</span> (gxc-outputs modf opts settings))
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([gsc: modf . opts] [(gsc-c-path modf settings)])</span>
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">ssi:</span> modf . submodules<span style="color: #7590db;">]</span> <span style="color: #7590db;">[</span>(library-path modf <span style="color: #2d9574;">".ssi"</span> settings)
                               (append-map (<span style="color: #4f97d7; font-weight: bold;">cut</span> spec-outputs <span style="color: #4f97d7;">&lt;&gt;</span> settings) submodules) <span style="color: #4f97d7;">...</span><span style="color: #7590db;">]</span>)
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([exe: modf . opts] [(library-path modf ".ssi" settings)</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;                      </span><span style="color: #2aa1ae; background-color: #292e34;">(binary-path modf opts settings)])</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([static-exe: modf . opts] [(binary-path modf opts settings)</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;                            </span><span style="color: #2aa1ae; background-color: #292e34;">(static-path modf settings)])</span>
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">static-include:</span> file<span style="color: #7590db;">]</span> <span style="color: #7590db;">[</span>(static-file-path file settings)<span style="color: #7590db;">]</span>)
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">copy:</span> file<span style="color: #7590db;">]</span> <span style="color: #7590db;">[</span>(library-path file <span style="color: #4f97d7;">#f</span> settings)<span style="color: #7590db;">]</span>)
    (<span style="color: #4f97d7; font-weight: bold;">else</span> (<span style="color: #4f97d7; font-weight: bold;">error</span> <span style="color: #2d9574;">"Bad buildspec"</span> spec))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-backgroundable?</span> spec)
  (<span style="color: #4f97d7; font-weight: bold;">case</span> (spec-type spec)
    ((<span style="color: #4f97d7;">gxc:</span>) (<span style="color: #4f97d7; font-weight: bold;">not</span> (pgetq <span style="color: #4f97d7;">foreground:</span> (spec-plist spec))))
    ((<span style="color: #4f97d7;">gsc:</span>) <span style="color: #4f97d7;">#t</span>)
    (<span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7;">#f</span>)))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">spec-build</span> spec settings)
  (<span style="color: #4f97d7; font-weight: bold;">match</span> spec
    ((<span style="color: #4f97d7;">?</span> string? modf)
     (gxc-compile modf <span style="color: #4f97d7;">#f</span> settings <span style="color: #4f97d7;">#t</span>))
    (<span style="color: #7590db;">[</span><span style="color: #4f97d7;">gxc:</span> modf . opts<span style="color: #7590db;">]</span>
     (gxc-compile modf opts settings <span style="color: #4f97d7;">#t</span>))
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([gsc: modf . opts]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(gsc-compile modf opts settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([ssi: modf . submodules]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(for-each (cut build &lt;&gt; settings) submodules)</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(compile-ssi modf '() settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([exe: modf . opts]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(compile-exe modf opts settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([static-exe: modf . opts]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(compile-static-exe modf opts settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([static-include: file]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(copy-static file settings))</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">([copy: file]</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">(copy-compiled file settings))</span>
    (<span style="color: #4f97d7; font-weight: bold;">else</span>
     (<span style="color: #4f97d7; font-weight: bold;">error</span> <span style="color: #2d9574;">"Bad buildspec"</span> spec))))
</pre>
</div>
</div>
</li>
