README.org
**** ~make/make~: The maker of makes

We very much want build.ss to be minimal. This is where the middle meddling all
takes place.

We'll just simply experiment. We error if there is no input, and warn if the
output "fails".

#+begin_src scheme :tangle "make/make.ss"
  package: std/make
  (import ./spec ./base ./settings)
  (export make)

  (def (make-spec spec settings)
    (def inputs (spec-inputs spec settings))
    (def outputs (spec-outputs spec settings))

    (let exists? ((is inputs))
      (unless (null? is)
        (unless (file-exists? (car is))
          (error "Build Input file does not exist: " (car is)))
        (exists? (cdr is))))

    (let (res (spec-build spec settings))
      (begin0 res
        (message "build result " res " for " spec)
        (let exists? ((os outputs))
          (unless (null? os) (unless (file-exists? (car os))
                               (displayln "\nBuild Output file does not exist: " (car os)))
                  (exists? (cdr os)))))))

  (def (make build-spec . args)
    (def settings (apply make-settings args))
    (let %make ((s build-spec))
      (def spec (car s)) (def rest (cdr s))
      (make-spec spec settings) (unless (null? rest) (%make rest))))
#+end_src

**** ~/make/script~: A clone of up above.

#+begin_src scheme :tangle make/script.ss
;;; -*- Gerbil -*-
;;; (C) vyzo at hackzen.org, me at drewc.ca
;;; package build script template
package: std/make
(import :std/make/make
        :gerbil/gambit/misc)

(export defmake-script build-main)

(def (build-main args build-spec keys that-file)
  (def srcdir (path-normalize (path-directory that-file)))
  (def (build) (apply make build-spec srcdir: srcdir keys))
  (match args
    (["meta"] (write '("spec" "compile")) (newline))
    (["spec"] (pretty-print build-spec))
    (["compile"] (build))
    ([] (build))))

(defsyntax (defmake-script stx)
  (syntax-case stx ()
    ((macro build-spec keys ...)
     (with-syntax* ((@this-script (stx-identifier #'macro 'this-source-file))
                    (+this-source-file+ (syntax/loc stx (@this-script)))
                    (@main        (stx-identifier #'macro 'main)))
       #'(def (@main . args)
           (build-main args build-spec [keys ...] +this-source-file+))))))
#+end_src
**** ~build.ss~: The makefile for making makefiles.

#+begin_src scheme :shebang "#!/usr/bin/env gxi" :tangle build.ss
  (import :gerbil/expander :std/misc/path )

  (def this-file (this-source-file))

  (def srcdir (path-directory this-file))

  (def build-specs
    '("make/base" "make/settings" "make/expander-module" "make/mod"
      "make/gsc" "make/gxc" "make/spec" "make/make" "make/script"))

  (gx#import-module (path-expand "make/bootstrap.ss" srcdir) #t #t)

  ((eval 'std/make/bootstrap#bootstrap-make) build-specs srcdir)
#+end_src


