doc/html/README.html


<li><a id="orgd3979fc"></a><code>make/make</code>: The maker of makes<br />
<div class="outline-text-5" id="text-orgd3979fc">
<p>
We very much want build.ss to be minimal. This is where the middle meddling all
takes place.
</p>

<p>
We'll just simply experiment. We error if there is no input, and warn if the
output "fails".
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">package:</span> std/make
(<span style="color: #4f97d7; font-weight: bold;">import</span> ./spec ./base ./settings)
(<span style="color: #4f97d7; font-weight: bold;">export</span> make)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">make-spec</span> spec settings)
  (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">inputs</span> (spec-inputs spec settings))
  (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">outputs</span> (spec-outputs spec settings))

  (<span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5; font-weight: bold;">exists?</span> ((is inputs))
    (<span style="color: #4f97d7; font-weight: bold;">unless</span> (null? is)
      (<span style="color: #4f97d7; font-weight: bold;">unless</span> (file-exists? (car is))
        (<span style="color: #4f97d7; font-weight: bold;">error</span> <span style="color: #2d9574;">"Build Input file does not exist: "</span> (car is)))
      (exists? (cdr is))))

  (<span style="color: #4f97d7; font-weight: bold;">let</span> (res (spec-build spec settings))
    (<span style="color: #4f97d7; font-weight: bold;">begin0</span> res
      (message <span style="color: #2d9574;">"build result "</span> res <span style="color: #2d9574;">" for "</span> spec)
      (<span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5; font-weight: bold;">exists?</span> ((os outputs))
        (<span style="color: #4f97d7; font-weight: bold;">unless</span> (null? os) (<span style="color: #4f97d7; font-weight: bold;">unless</span> (file-exists? (car os))
                             (displayln <span style="color: #2d9574;">"\nBuild Output file does not exist: "</span> (car os)))
                (exists? (cdr os)))))))

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">make</span> build-spec . args)
  (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">settings</span> (<span style="color: #4f97d7; font-weight: bold;">apply</span> make-settings args))
  (<span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5; font-weight: bold;">%make</span> ((s build-spec))
    (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">spec</span> (car s)) (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">rest</span> (cdr s))
    (make-spec spec settings) (<span style="color: #4f97d7; font-weight: bold;">unless</span> (null? rest) (%make rest))))
</pre>
</div>
</div>
</li>

<li><a id="org5d3febd"></a><code>/make/script</code>: A clone of up above.<br />
<div class="outline-text-5" id="text-org5d3febd">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">-*- Gerbil -*-</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">(C) vyzo at hackzen.org, me at drewc.ca</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">package build script template</span>
<span style="color: #4f97d7;">package:</span> std/make
(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:std/make/make</span>
        <span style="color: #4f97d7;">:gerbil/gambit/misc</span>)

(<span style="color: #4f97d7; font-weight: bold;">export</span> defmake-script build-main)

(<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">build-main</span> args build-spec keys that-file)
  (<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">srcdir</span> (path-normalize (path-directory that-file)))
  (<span style="color: #4f97d7; font-weight: bold;">def</span> (<span style="color: #bc6ec5; font-weight: bold;">build</span>) (<span style="color: #4f97d7; font-weight: bold;">apply</span> make build-spec <span style="color: #4f97d7;">srcdir:</span> srcdir keys))
  (<span style="color: #4f97d7; font-weight: bold;">match</span> args
    (<span style="color: #7590db;">[</span><span style="color: #2d9574;">"meta"</span><span style="color: #7590db;">]</span> (write <span style="color: #4f97d7; font-weight: bold;">'</span>(<span style="color: #2d9574;">"spec"</span> <span style="color: #2d9574;">"compile"</span>)) (newline))
    (<span style="color: #7590db;">[</span><span style="color: #2d9574;">"spec"</span><span style="color: #7590db;">]</span> (pretty-print build-spec))
    (<span style="color: #7590db;">[</span><span style="color: #2d9574;">"compile"</span><span style="color: #7590db;">]</span> (build))
    (<span style="color: #7590db;">[]</span> (build))))

(<span style="color: #4f97d7; font-weight: bold;">defsyntax</span> (<span style="color: #7590db;">defmake-script</span> stx)
  (<span style="color: #4f97d7; font-weight: bold;">syntax-case</span> stx ()
    ((macro build-spec keys <span style="color: #4f97d7;">...</span>)
     (<span style="color: #4f97d7; font-weight: bold;">with-syntax*</span> ((<span style="color: #7590db;">@</span>this-script (stx-identifier <span style="color: #4f97d7; font-weight: bold;">#'</span>macro <span style="color: #4f97d7; font-weight: bold;">'</span>this-source-file))
                    (+this-source-file+ (<span style="color: #4f97d7; font-weight: bold;">syntax/loc</span> stx (<span style="color: #7590db;">@</span>this-script)))
                    (<span style="color: #7590db;">@</span>main        (stx-identifier <span style="color: #4f97d7; font-weight: bold;">#'</span>macro <span style="color: #4f97d7; font-weight: bold;">'</span>main)))
       <span style="color: #4f97d7; font-weight: bold;">#'</span>(def (<span style="color: #7590db;">@</span>main . args)
           (build-main args build-spec <span style="color: #7590db;">[</span>keys <span style="color: #4f97d7;">...</span><span style="color: #7590db;">]</span> +this-source-file+))))))
</pre>
</div>
</div>
</li>
<li><a id="org357c6f2"></a><code>build.ss</code>: The makefile for making makefiles.<br />
<div class="outline-text-5" id="text-org357c6f2">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">:gerbil/expander</span> <span style="color: #4f97d7;">:std/misc/path</span> )

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">this-file</span> (this-source-file))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">srcdir</span> (path-directory this-file))

(<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">build-specs</span>
  <span style="color: #4f97d7; font-weight: bold;">'</span>(<span style="color: #2d9574;">"make/base"</span> <span style="color: #2d9574;">"make/settings"</span> <span style="color: #2d9574;">"make/expander-module"</span> <span style="color: #2d9574;">"make/mod"</span>
    <span style="color: #2d9574;">"make/gsc"</span> <span style="color: #2d9574;">"make/gxc"</span> <span style="color: #2d9574;">"make/spec"</span> <span style="color: #2d9574;">"make/make"</span> <span style="color: #2d9574;">"make/script"</span>))

(gx<span style="color: #4f97d7;">#</span>import-module (path-expand <span style="color: #2d9574;">"make/bootstrap.ss"</span> srcdir) <span style="color: #4f97d7;">#t</span> <span style="color: #4f97d7;">#t</span>)

((<span style="color: #4f97d7; font-weight: bold;">eval</span> <span style="color: #4f97d7; font-weight: bold;">'</span>std/make/bootstrap<span style="color: #4f97d7;">#</span>bootstrap-make) build-specs srcdir)
</pre>
</div>
</div>
</li>
</ul>
</div>
